[{
  "title": "Data Scientist 1",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "3 days ago",
  "publishedAt": "2025-08-06",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-scientist-1-at-uber-4281429105?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About The Role\n\nCommunication Platform enables all the messages (SMS OTP, Whatsapp, Notifications, Voice Call, Chat) among our users. This role will help improve our communications products in improving the Deliverability, reliability and reach of the messages by optimising the cost at the same time. Improving effieciency of communications among our users will helop improve trip conversion and in turn revenue for the organization.\n\nWhat The Candidate Will Need / Bonus Points\n\n---- What the Candidate Will Do ----\n\n\n * Build scalable analytical frameworks to support product analytics for Uber's Communications Platform\n * Own new product experimentation including plan creation, roll-out, and monitoring\n * Be an invaluable partner to cross-functional teams such as engineering, product management, various data teams to deploy data quality across critical pipelines and to set up processes to triage data issues\n * Develop and track metrics and reporting functions to measure and monitor products performance on our platform\n * Effectively and proactively communicate insights and drive projects to drive towards team goals\n * Proactively seek out opportunities to build new solutions to tackle challenges\n * Create and drive data quality standards and frameworks to ensure inclusion into pipeline engineering efforts\n   \n   \n\nBasic Qualifications\n\n\n * 2+ years of experience (Bachelor) OR 1+ years of experience (Masters) in a data-focused role such as product analytics, business analytics, business operations, or data science\n * Education in Engineering, Computer Science, Math, Economics, Statistics or equivalent experience\n * Experience in programming and/or query languages\n * Past experience with a Product / Tech company serving millions of customers on multiple platforms and countries\n   \n   \n\nPreferred Qualifications\n\n\n * SQL mastery. Write efficient and complex code in SQL\n * Experience in Python/R and experimentation, A/B testing, and statistical modelling\n * Experience in Payments or Compliance with a Product / Tech company\n * Proven ability to handle and visualise large datasets, explore and utilize raw data feeds\n * Love of data - you just go get the data you need and turn it into an insightful story.\n * A well-organized, structured approach to problem-solving\n * Strong sense of ownership, accountability, and entrepreneurial spirit\n * Great communicator, problem-solver & confident in decision making\n * Independent & autonomous, while still a strong teammate\n * Enthusiastic, self-starting and thrives in changing, agile environments",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Internet Marketplace Platforms",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://tnl2.jometer.com/v2/job?jz=5wqzscb98537c91c3e094982f707e7a7c51e5M4ALBBQAAADQ&iis=Job%20Board%20-%20Recruitment%20Marketing&iisn=LinkedIn",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Product Data Scientist, Google Play Games",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-29",
  "jobUrl": "https://in.linkedin.com/jobs/view/product-data-scientist-google-play-games-at-google-4262193822?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\n * 5 years of work experience with analysis applications (extracting insights, performing statistical analysis, or solving business problems), and coding (Python, R, SQL), or 2 years of experience with a Master's degree.\n   \n   \n\nPreferred qualifications:\n\n\n * Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\n * 5 years of experience working in a complex, matrixed organization.\n * 5 years of experience preparing and delivering technical presentations to executive leadership.\n * 3 years of experience in mobile advertising analytics.\n   \n   \n\nAbout The Job\n\nHelp serve Google's worldwide user base of more than a billion people. Data Scientists provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make critical recommendations for your fellow Googlers in Engineering and Product Management. You relish tallying up the numbers one minute and communicating your findings to a team leader the next.\n\nThe Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.\n\nResponsibilities\n\n\n * Work across Games Spend and business generation, Developer Success, and Games Ecosystem to further our understanding of the Games business at Play.\n * Partner with Games Data Science and Product Strategy team members, Play Games Product Management (PM), Engineering (Eng), Product Marketing Management (PMM), User Experience (UX) and other teams to understand user behavior, design/analyze experiments and drive product insights to improve user experiences.\n * Deliver effective presentations of findings and recommendations to multiple levels of leadership, shaping Play's investment in Games.\n * Develop a comprehensive understanding of the gaming industry.\n * Perform statistical analyses in R/Python, data extraction using SQL, and build pipelines and dashboards using Plx tools.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Customer Service and Product Management",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/127590661195997894-product-data-scientist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Scientist II",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "6 days ago",
  "publishedAt": "2025-08-03",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-scientist-ii-at-microsoft-4279388328?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "Security represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world.\n\nThe Defender Experts (DEX) Research team is at the forefront of Microsoft’s threat protection strategy, combining world-class hunting expertise with AI-driven analytics to protect customers from advanced cyberattacks. Our mission is to move protection left—disrupting threats early, before damage occurs—by transforming raw signals into intelligence that powers detection, disruption, and customer trust.\n\nWe’re looking for a passionate and curious Data Scientist to join this high-impact team. In this role, you'll partner with researchers, hunters, and detection engineers to explore attacker behavior, operationalize entity graphs, and develop statistical and ML-driven models that enhance DEX’s detection efficacy. Your work will directly feed into real-time protections used by thousands of enterprises and shape the future of Microsoft Security. This is an opportunity to work on problems that matter—with cutting-edge data, a highly collaborative team, and the scale of Microsoft behind you.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * Understand complex cybersecurity and business problems, translate them into well-defined data science problems, and build scalable solutions.\n * Design and build robust, large-scale graph structures to model security entities, behaviors, and relationships.\n * Develop and deploy scalable, production-grade AI/ML systems and intelligent agents for real-time threat detection, classification, and response.\n * Collaborate closely with Security Research teams to integrate domain knowledge into data science workflows and enrich model development.\n * Drive end-to-end ML lifecycle: from data ingestion and feature engineering to model development, evaluation, and deployment.\n * Work with large-scale graph data: create, query, and process it efficiently to extract insights and power models.\n * Lead initiatives involving Graph ML, Generative AI, and agent-based systems, driving innovation across threat detection, risk propagation, and incident response.\n * Collaborate closely with engineering and product teams to integrate solutions into production platforms.\n * Mentor junior team members and contribute to strategic decisions around model architecture, evaluation, and deployment.\n   \n   \n\nQualifications\n\n\n * Bachelor’s or Master’s degree in Computer Science, Statistics, Applied Mathematics, Data Science, or a related quantitative field\n * 3+ years of experience applying data science or machine learning in a real-world setting, preferably in security, fraud, risk, or anomaly detection\n * Proficiency in Python and/or R, with hands-on experience in data manipulation (e.g., Pandas, NumPy), modeling (e.g., scikit-learn, XGBoost), and visualization (e.g., matplotlib, seaborn)\n * Strong foundation in statistics, probability, and applied machine learning techniques\n * Experience working with large-scale datasets, telemetry, or graph-structured data Ability to clearly communicate technical insights and influence cross-disciplinary teams\n * Demonstrated ability to work independently, take ownership of problems, and drive solutions end-to-end\n   \n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "139 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1854865/Data-Scientist-II?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Scientist, Research, App Safety Engineering",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "4 days ago",
  "publishedAt": "2025-08-06",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-scientist-research-app-safety-engineering-at-google-4280830997?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, or a related quantitative field.\n * 5 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or 3 years of work experience with a PhD degree.\n   \n   \n\nPreferred qualifications:\n\n\n * 8 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or 6 years of work experience with a PhD degree.\n * Experience articulating and translating business questions and using statistical techniques to arrive at an answer using available data.\n   \n   \n\nAbout The Job\n\nAt Google, data drives all of our decision-making. Quantitative Analysts work all across the organization to help shape Google's business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical excellence and statistical methods, you mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As an analyst, you do more than just crunch the numbers. You work with Engineers, Product Managers, Sales Associates and Marketing teams to adjust Google's practices according to your findings. Identifying the problem is only half the job; you also figure out the solution.\n\nThe team's mission is to protect Android users from abusive apps, including malware, content abuse, impersonation, and behavioral abuse. As a Data Scientist on the App Safety Engineering (ASE) team, you will work with multiple stakeholders across product, engineering, and operation teams to conduct data research, build methodologies into production systems to drive ASE key decisions and development. You will be responsible for translating data into recommendations and implementing process improvements.\n\nResponsibilities\n\n\n * Work with datasets, solve non-routine analysis problems, and apply quantitative methods as needed.\n * Conduct analysis that includes data gathering and requirements specification, processing, analysis, model development and evaluation, as well as written and verbal delivery of results to business partners.\n * Collaborate with stakeholders in Product Management, Engineering, and Operation teams to define questions, objectives, and metrics, identify and implement quantitative methods to answer those questions.\n * Develop, own, and evolve methodologies and frameworks providing a source of truth measures for the organization.\n * Establish comprehensive understanding of the production systems, advocate for changes where needed for product development, and build data driven solutions to faciliate the efficacy improvement.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "83 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "General Business, Strategy/Planning, and Consulting",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/83898440466997958-data-scientist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Marketing Analyst",
  "location": "Gurgaon, Haryana, India",
  "postedTime": "5 days ago",
  "publishedAt": "2025-08-05",
  "jobUrl": "https://in.linkedin.com/jobs/view/marketing-analyst-at-google-4266527969?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in a research or quantitative field (e.g., Mathematics, Statistics, Engineering, Bioinformatics, Economics, etc.) or equivalent practical experience.\n * 3 years of experience designing, scoping, executing, and delivering research and analysis projects.\n * 3 years of experience translating business problems into research questions and translating research findings and insights into marketing recommendations.\n * Experience managing research and measurement agencies.\n   \n   \n\nPreferred qualifications:\n\n\n * 5 years of experience as a marketing analyst using statistical techniques (e.g., hypothesis development, designing tests/experiments, and significance testing).\n * 3 years of experience of statistical modeling and advanced measurement/analysis techniques (e.g., regression analysis, geo-experimentation, Brand/Conversion lift measurement, machine learning algorithms).\n * Experience in data querying languages (e.g., SQL) and tools to work with large complex data sets, and programming languages (e.g., Python) to run analysis.\n * Experience in using data for storytelling and presenting complex research findings to both technical and non-technical audiences and using analytical insights to guide media planning.\n   \n   \n\nAbout The Job\n\nGoogle's leadership team hand-picks thorny business challenges, and members of BizOps work in small teams to find solutions. As part of this team you fully immerse yourself in data collection, draw insight from analysis, and then zoom out to develop compelling, synthesized recommendations. Taking strategy one step further, you also persuasively communicate your recommendations to senior-level executives, roll-up your sleeves to help drive implementation and check back-in to see the impact of your recommendations.\n\nResponsibilities\n\n\n * Use your knowledge of data analytics to develop solutions for marketing challenges, while also uncovering opportunities for measurement and optimization to push brand and performance marketing to the next level.\n * Build measurement plans, tracking requirements, reporting, metrics and benchmarks for our largest campaigns to understand the incremental impact of our marketing dollars (e.g., conversion lift tests, matched market analyses, and brand lift studies).\n * Analyze campaign results and report the media effectiveness across all stakeholder groups.\n * Develop processes to ensure all stakeholders align and understand how we determine campaign success.\n * Conduct analysis, find best practices, and surface opportunities and risks otherwise not identified to executive stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, Advertising, and Marketing",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/123547144370954950-marketing-analyst/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Engineering Analyst, Trust and Safety",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-24",
  "jobUrl": "https://in.linkedin.com/jobs/view/engineering-analyst-trust-and-safety-at-google-4259193768?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India.Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 1 year of experience in data analysis, including identifying trends, generating summary statistics, and drawing insights from quantitative and qualitative data.\n * 1 year of experience managing projects and defining project scope, goals, and deliverables.\n   \n   \n\nPreferred qualifications:\n\n\n * 2 years of experience in the Payments industry, working on risk or fraud management and in one or more of the following areas: statistical analysis and machine learning libraries (e.g., R, Scikit-learn,Tensorflow), programming languages (e.g., Python, C/C++), Large Language Models (LLMs) or Generative AI.\n * Experience in innovation, technology and Google products.\n * Ability to interact with internal and external stakeholders with attention to detail in an ever-changing environment.\n * Ability to identify workflow pain points, optimize, automate and scale processes.\n * Excellent communication, problem-solving and critical thinking skills.\n   \n   \n\nAbout The Job\n\nTrust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.\n\nIn this role, you will work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed, in order to ensure a safe and secure Payments ecosystem for our users. You will identify and solve problems and have technical skills to optimize our processes and tools. You will be proactive, motivated, organized, reliable, and able to work well in a fast-paced, global, cross-functional, and team-oriented environment to get things done. You will promote users trust in Google and ensure the highest levels of user safety.\n\nAt Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.\n\nResponsibilities\n\n\n * Investigate fraud and abuse incidents, identify patterns and trends in order to generate risk management solutions. Promote user trust and safety by managing and mitigating payment fraud, scams and abuse on Google products and services.\n * Perform statistical analysis using payments and risk data warehouse, collaborate with engineering and product teams to create and enhance tools, develop signals, improve system functionality, accuracy and efficiency.\n * Facilitate and manage operations programs, working closely with Google engineers, product managers and vendor operations to develop and track project schedules and timelines. Use technical experience to drive and implement automation opportunities.\n * Perform end-to-end assessment of the associated risk and vulnerability of products and features. Respond to escalations from internal and external parties within designated service levels.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "General Business, Strategy/Planning, and Consulting",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/108498582377505478-engineering-analyst/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Artificial Intelligence Engineer (English)",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-22",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-artificial-intelligence-engineer-english-at-google-4270783338?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science or related technical field, or equivalent practical experience.\n * Experience building data and AI solutions and working with technical customers.\n * Experience designing cloud enterprise solutions and supporting customer projects to completion.\n * Ability to communicate in English fluently to support client relationship management in this region.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience working with Large Language Models, data pipelines, and with data analytics, data visualization techniques.\n * Experience with core Data ETL techniques.\n * Experience in leveraging LLMs to deploy multimodal solutions encompassing Text, Image, Video and Voice.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ ELT and reporting/analytic tools and environments (Apache Beam, Hadoop, Spark, Pig, Hive, MapReduce, Flume).\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n   \n   \n\nAbout The Job\n\nThe Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners.\n\nAs a Cloud Engineer, you'll play a key role in ensuring that strategic customers have the best experience moving to the Google Cloud GenAI and Agentic AI suite of products. You will design and implement solutions for customer use cases, leveraging core Google products. You'll work with customers to identify opportunities to transform their business with GenAI, and deliver workshops designed to educate and empower customers to realize the full potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product issues, and address customer and partner needs. In this role, you will lead the timely execution of adopting the Google Cloud Platform solutions to the customer.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver effective big data and GenAI solutions and solve complex technical customer challenges.\n * Act as a trusted technical advisor to Google’s strategic customers.\n * Identify new product features and feature gaps, provide guidance on existing product challenges, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practices recommendations, tutorials, blog articles, and technical presentations adapting to different levels of key business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/141374000985973446-cloud-artificial-intelligence-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Scientist 1",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "3 days ago",
  "publishedAt": "2025-08-06",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-scientist-1-at-uber-4281428228?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About The Role\n\nCommunication Platform enables all the messages (SMS OTP, Whatsapp, Notifications, Voice Call, Chat) among our users. This role will help improve our communications products in improving the Deliverability, reliability and reach of the messages by optimising the cost at the same time. Improving effieciency of communications among our users will helop improve trip conversion and in turn revenue for the organization.\n\nWhat The Candidate Will Need / Bonus Points\n\n---- What the Candidate Will Do ----\n\n\n * Build scalable analytical frameworks to support product analytics for Uber's Communications Platform\n * Own new product experimentation including plan creation, roll-out, and monitoring\n * Be an invaluable partner to cross-functional teams such as engineering, product management, various data teams to deploy data quality across critical pipelines and to set up processes to triage data issues\n * Develop and track metrics and reporting functions to measure and monitor products performance on our platform\n * Effectively and proactively communicate insights and drive projects to drive towards team goals\n * Proactively seek out opportunities to build new solutions to tackle challenges\n * Create and drive data quality standards and frameworks to ensure inclusion into pipeline engineering efforts\n   \n   \n\nBasic Qualifications\n\n\n * 2+ years of experience (Bachelor) OR 1+ years of experience (Masters) in a data-focused role such as product analytics, business analytics, business operations, or data science\n * Education in Engineering, Computer Science, Math, Economics, Statistics or equivalent experience\n * Experience in programming and/or query languages\n * Past experience with a Product / Tech company serving millions of customers on multiple platforms and countries\n   \n   \n\nPreferred Qualifications\n\n\n * SQL mastery. Write efficient and complex code in SQL\n * Experience in Python/R and experimentation, A/B testing, and statistical modelling\n * Experience in Payments or Compliance with a Product / Tech company\n * Proven ability to handle and visualise large datasets, explore and utilize raw data feeds\n * Love of data - you just go get the data you need and turn it into an insightful story.\n * A well-organized, structured approach to problem-solving\n * Strong sense of ownership, accountability, and entrepreneurial spirit\n * Great communicator, problem-solver & confident in decision making\n * Independent & autonomous, while still a strong teammate\n * Enthusiastic, self-starting and thrives in changing, agile environments",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Internet Marketplace Platforms",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://tnl2.jometer.com/v2/job?jz=5wqzs32df29f4160ac0bdf306228055878fb1M4ALBBQAAADQ&iis=Job%20Board%20-%20Recruitment%20Marketing&iisn=LinkedIn",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Search Specialist",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-23",
  "jobUrl": "https://in.linkedin.com/jobs/view/search-specialist-at-google-4271324313?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring campaigns and providing client solutions.\n   \n   \n\nPreferred qualifications:\n\n\n * 3 years of experience with Internet products and technologies.\n * Experience in data analysis, with the ability to interpret datasets, identify trends, and translate findings into compelling narratives.\n * Knowledge of apps platforms and products, the performance advertising market, or online ads landscape.\n * Ability to collaborate cross-functionally with multiple teams and stakeholders while building relationships.\n * Excellent project management skills, with the ability to oversee multiple, simultaneous solutions, supported by internal teams.\n * Excellent business communication, negotiation, and influencing skills.\n   \n   \n\nAbout The Job\n\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\n\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video .\n\nResponsibilities\n\n\n * Advise Google Ads clients, leveraging digital marketing and tech solutions to address business issues, collaborate as a thought partner, design media plans, and deliver technical solutions to achieve business goals.\n * Build relationships with external advertisers to deliver business outcomes through Google Ads, supporting planning, pitching, implementation, and optimization to boost product adoption and business growth.\n * Collaborate with teams to drive growth plans for clients, develop and apply insights for vertical and sub-verticals in solutions offered.\n * Deliver consultative digital marketing solutions that address issues and enhance the customer's experience.\n * Advocate new product features, assist with adoption through setup, and provide technical guidance for infrastructure and data integration in Google Ads.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, Advertising, and Customer Service",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/128980206059692742-search-specialist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Applied Scientist",
  "location": "Noida, Uttar Pradesh, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-25",
  "jobUrl": "https://in.linkedin.com/jobs/view/applied-scientist-at-microsoft-4275644924?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "Are you passionate about building intelligent systems that enhance productivity in Office applications? Do you have a strong foundation in machine learning, natural language processing (NLP), and software engineering? Join our team of Applied Scientists and engineers working at the forefront of generative AI to shape the future of productivity tools.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * Applied Research & Development: Contribute to the design and implementation of machine learning models and algorithms for search, summarization, and content understanding in Office applications.\n * Model Development: Build and fine-tune ML/DL models using frameworks like PyTorch or TensorFlow. Collaborate on deploying models in production environments with a focus on scalability and performance.\n * Cross-Functional Collaboration: Work closely with engineering, product, and research teams to translate business needs into technical solutions and deliver impactful features.\n * Experimentation & Evaluation: Conduct experiments, analyze results, and iterate on solutions to improve precision, recall, and user satisfaction.\n * Innovation: Stay current with research trends in generative AI and NLP. Explore new signals, data sources, and modeling techniques to evolve intelligent systems and contribute to the Copilot ecosystem.\n   \n   \n\nQualifications\n\nRequired Qualifications:\n\n\n * Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field\n    * OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field\n    * OR equivalent experience.\n\n * Minimun 1 year of industry experience in applied machine learning or data science roles.\n * Proficiency in Python\n * Experience developing and evaluating generative AI models.\n * Familiarity with NLP techniques and content understanding.\n * Strong verbal and written communication skills to explain complex technical concepts to diverse audiences.\n * Ability to tackle open-ended problems and deliver practical, scalable solutions.\n   \n\nPreferred Qualifications\n\n\n * Proficiency in ML libraries such as PyTorch or TensorFlow.\n * Experience deploying ML models in production environments.\n * Exposure to full product lifecycle from prototyping to deployment and iteration.\n * Contributions to research publications, patents, or open-source projects.\n   \n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1842471/Applied-Scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Scientist II",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-25",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-scientist-ii-at-microsoft-4275640911?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "Do you want to help shape the future of Copilot in Windows and AI investments through your analyses and insights? Are you passionate about delivering the next generation of user-facing AI scenarios to the hundreds of millions of people who use Windows every single day? Does the thought of partnering closely with product teams to influence the product in each stage of the lifecycle through data and insights excite you very much? Do you seek novel ways to gain insights from data and love to tell stories with those insights? Do you love driving growth in customer and business metrics by generating data driven hypotheses and running experiments? If so, we would like to talk to you!\n\nAs a Data Scientist II, you will be delivering the next generation of user-facing scenarios to the hundreds of millions of people who use Windows every single day. You will partner closely with product teams to influence the product in each stage of the lifecycle through data and insights. Drive growth in customer and business metrics by generating data driven hypotheses, designing and running experiments.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * Working closely with a variety of teams including senior leadership, product management, software engineers, design, User Research to understand the key business questions for customer-facing scenarios.\n * Identify instrumentation needs, define and set up metrics and OKRs, deeply analyze the data to identify insights and experiment ideas that move our business metrics.\n * Design and execute on Growth Experiments, analyze results to identify key insights.\n * Help evaluate the return of investments on new ideas, to assess if investments are meeting customer and business promises, and hypotheses and insights to drive growth.\n   \n   \n\nQualifications\n\nRequired Qualifications:\n\n\n * Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field\n    * OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 2+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical)\n    * OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical)\n    * OR equivalent experience.\n\n * 1+ year(s) customer-facing, project-delivery experience, professional services, and/or consulting experience.\n   \n\nPreferred Qualifications\n\n\n * Experience with Exploratory Data Analyses, Inference analysis, Predictive analysis (Regression, Classification etc.,) and forecasting.\n * Experience with Experiment Design and analysis.\n * Demonstrated leadership in complex areas, through critical thinking, thought leadership, technical skills and relentless drive for progress.\n   \n   \n\n#W+DJobs\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "184 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1848132/Data-Scientist-II?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "AI Protection Analyst",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-31",
  "jobUrl": "https://in.linkedin.com/jobs/view/ai-protection-analyst-at-google-4274222116?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience in data analysis, including identifying trends, generating summary statistics, and drawing insights from quantitative and qualitative data.\n * 2 years of experience managing projects and defining project scope, goals, and deliverables.\n   \n   \n\nPreferred qualifications:\n\n\n * Master's Degree in Computer Science.\n * 4 years of relevant work experience in a large-scale data analysis.\n * 2 years of experience with machine learning systems.\n * Experience in at least one programming language (e.g., Go, Python, R, Julia, C/C++, Java, SQL).\n * Experience in security threat or abuse detection, analysis and investigation.\n * Excellent written and verbal communication skills.\n   \n   \n\nAbout the jobTrust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.\n\nTrust and Safety Cloud AI Protection (CAIP)’s mission is to enable the rapid growth of Google Cloud Platform (GCP) and Workspace AI businesses by curbing associated safety and security risks.CAIP supports GCP and Workspace AI products throughout their life-cycle by advancing safety protection mechanisms in the earliest stages of product design. Specifically, CAIP’s service portfolio includes both pre and post launch capabilities.\n\nAs an AI Protection analyst, you will have the opportunity to shape the safety of Google AI products. You will ensure that our AI products are not only powerful but also safe, secure, and aligned with our AI principles and every AI product is as resilient as it can be by designing and building an industry leading AI agent system to protect Google AI from misuse. You will help to solve challenging problems in AI safety and misuse at Google scale.At Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.\n\nResponsibilities\n\n\n * Identify and investigate possible failure modes for GenAI products on a broad range from sociotechnical harms to misuse.\n * Design and build implementation for anti-abuse detection and action systems, including detection and enforcement AI agents, to protect Google Cloud and Workspace AI products at scale.\n * Perform in-depth analysis of risks, measure and mitigate AI-related risks, using benchmarking, evaluations, dataset design, and usage monitoring.\n * Prepare analysis reports and present findings and solutions to stakeholders with exceptional written and verbal communication.\n * Collaborate with other Google teams to ensure that the issues are understood and solutions are adopted.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Product Management and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/129152427805811398-ai-protection-analyst/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Engineer, AI",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-22",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-engineer-ai-at-google-4270553309?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurugram, Haryana, India; Bengaluru, Karnataka, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.\n * Experience building Machine Learning or Data Science solutions.\n * Experience writing software in Python, Scala, R, or similar.\n * Experience with data structures, algorithms, and software design.\n * Ability to travel up to 30% of the time.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience working with recommendation engines, data pipelines, or distributed machine learning, data analytics, data visualization techniques and software, and deep learning frameworks.\n * Experience in software development, professional services, solution engineering, technical consulting, architecting and rolling out new technology and solution initiatives.\n * Experience with core Data Science techniques.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ELT and reporting/analytic tools and environments.\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n * Excellent customer-facing communication and listening skills.\n   \n   \n\nAbout The Job\n\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\n\nAs a Cloud Engineer, you will play a key role in ensuring that customers have the best experience moving to the Google Cloud machine learning (ML) suite of products. You will design and implement machine learning solutions for customer use cases, leveraging core Google products. You will work with customers to identify opportunities to transform their business with machine learning, and will travel to customer sites to deploy solutions and deliver workshops designed to educate and empower customers to realize the full potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product code, and address customer and partner needs. In this role, you will lead the timely execution of adopting the Google Cloud Platform solutions to the customer’s requirements.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver effective big data and machine learning solutions and solve technical customer issues.\n * Act as a technical advisor to Google’s customers.\n * Identify new product features and feature gaps, provide guidance on existing product issues, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practice recommendations, tutorials, blog articles, and technical presentations adapting to different levels of key business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/107163409652294342-cloud-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Artificial Intelligence Engineer",
  "location": "Pune, Maharashtra, India",
  "postedTime": "3 days ago",
  "publishedAt": "2025-08-07",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-artificial-intelligence-engineer-at-google-4267994873?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Pune, Maharashtra, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science or a related technical field, or equivalent practical experience.\n * 3 years of experience in building data and Artificial Intelligence (AI) solutions and working with technical customers.\n * Experience in designing cloud enterprise solutions and supporting customer projects to completion.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience in working with Large Language Models, data pipelines, and with data analytics, data visualization techniques.\n * Experience with Data Extract, Transform, and Load (ETL) techniques.\n * Experience in Large Language Models (LLMs) to deploy multimodal solutions involving Text, Image, Video and Voice.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, Extract, Transform, and Load/Extract, Load and Transform and investigative tools and environments (e.g., Apache Beam, Hadoop, Spark, Pig, Hive, MapReduce, Flume).\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n * Excellent communication skills.\n   \n   \n\nAbout the jobThe Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners.\n\nIn this role, you will play a role in ensuring that customers have the quality experience moving to the Google Cloud Generative AI (GenAI) and Agentic AI suite of products. You will design and implement solutions for customer use cases, leveraging core Google products. You will work with customers to identify opportunities to transform their business with Generative AI (GenAI), and deliver workshops designed to educate and empower customers to realize the potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product issues, and address customer and partner needs. You will lead the execution of adopting the Google Cloud Platform solutions to the customer.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver big data and GenAI solutions and solve technical customer tests.\n * Act as a trusted technical advisor to Google’s customers.\n * Identify new product features and feature gaps, provide guidance on existing product tests, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practices recommendations, tutorials, blog articles, and technical presentations adapting to different levels of business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/104570819216057030-cloud-artificial-intelligence-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Engineering Analyst, Trust and Safety",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-24",
  "jobUrl": "https://in.linkedin.com/jobs/view/engineering-analyst-trust-and-safety-at-google-4259193766?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India.Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 1 year of experience in data analysis, including identifying trends, generating summary statistics, and drawing insights from quantitative and qualitative data.\n * 1 year of experience managing projects and defining project scope, goals, and deliverables.\n   \n   \n\nPreferred qualifications:\n\n\n * 2 years of experience in the Payments industry, working on risk or fraud management and in one or more of the following areas: statistical analysis and machine learning libraries (e.g., R, Scikit-learn,Tensorflow), programming languages (e.g., Python, C/C++), Large Language Models (LLMs) or Generative AI.\n * Experience in innovation, technology and Google products.\n * Ability to interact with internal and external stakeholders with attention to detail in an ever-changing environment.\n * Ability to identify workflow pain points, optimize, automate and scale processes.\n * Excellent communication, problem-solving and critical thinking skills.\n   \n   \n\nAbout The Job\n\nTrust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.\n\nIn this role, you will work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed, in order to ensure a safe and secure Payments ecosystem for our users. You will identify and solve problems and have technical skills to optimize our processes and tools. You will be proactive, motivated, organized, reliable, and able to work well in a fast-paced, global, cross-functional, and team-oriented environment to get things done. You will promote users trust in Google and ensure the highest levels of user safety.\n\nAt Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.\n\nResponsibilities\n\n\n * Investigate fraud and abuse incidents, identify patterns and trends in order to generate risk management solutions. Promote user trust and safety by managing and mitigating payment fraud, scams and abuse on Google products and services.\n * Perform statistical analysis using payments and risk data warehouse, collaborate with engineering and product teams to create and enhance tools, develop signals, improve system functionality, accuracy and efficiency.\n * Facilitate and manage operations programs, working closely with Google engineers, product managers and vendor operations to develop and track project schedules and timelines. Use technical experience to drive and implement automation opportunities.\n * Perform end-to-end assessment of the associated risk and vulnerability of products and features. Respond to escalations from internal and external parties within designated service levels.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "General Business, Strategy/Planning, and Consulting",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/108498582377505478-engineering-analyst/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Chief of Staff, gTech Ads Customer Experience",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-23",
  "jobUrl": "https://in.linkedin.com/jobs/view/chief-of-staff-gtech-ads-customer-experience-at-google-4271321960?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 6 years of experience in management consulting or strategy/business planning.\n * 6 years of experience in Business Intelligence, Data Science, Analytics, or Statistics, or 4 years of experience with an advanced degree.\n * Experience analyzing data and creating reports with database queries (e.g. SQL).\n   \n   \n\nPreferred qualifications:\n\n\n * 8 years of experience in Management Consulting, Strategy/Business Planning, an Office of CXO (CEO, CFO, COO, or other Chief-level executive) role.\n * Experience in improving Customer Experience or Customer Satisfaction.\n * Experience with improving Operations or Customer Support functions.\n * Experience with working in a global multi-site environment.\n * Experience in leading and executing strategic initiatives.\n * Strong business acumen with the ability to think strategically for the long term while effectively driving short-term execution and results.\n   \n   \n\nAbout the jobGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customer's needs.\n\nAs a Chief of Staff, you will have a unique opportunity to work closely with executive leadership to shape the strategy of the organization and create significant business impact.Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video .\n\nResponsibilities\n\n\n * Serve as a trusted advisor to the VP and the leadership team, provide insights, anticipate business needs, and enable transformation.\n * Develop plans and maintain strong relationships with the stakeholders through prioritizing, strategizing, problem solving, reporting and communicating. Define the executive communications strategy, ensuring consistent and impactful information sharing.\n * Develop and manage the organization's rhythm of business, including key meetings, reviews, summits/offsites and budget management.\n * Shape the organization priorities and drive leadership engagements (e.g., weekly staff meetings), ensure fast decision-making, delivery against the highest priorities across the business.\n * Provide insights and recommendations based on data analysis and business metrics.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "189 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, General Business, and Customer Service",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/136626828394537670-chief-of-staff/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Applied & Data scientist",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-25",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-applied-data-scientist-at-microsoft-4275651242?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "Security represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world.\n\nThe Defender Experts (DEX) Research team is at the forefront of Microsoft’s threat protection strategy, combining world-class hunting expertise with AI-driven analytics to protect customers from advanced cyberattacks. Our mission is to move protection left—disrupting threats early, before damage occurs—by transforming raw signals into intelligence that powers detection, disruption, and customer trust. We’re looking for a passionate and curious Data Scientist to join this high-impact team. In this role, you'll partner with researchers, hunters, and detection engineers to explore attacker behavior, operationalize entity graphs, and develop statistical and ML-driven models that enhance DEX’s detection efficacy. Your work will directly feed into real-time protections used by thousands of enterprises and shape the future of Microsoft Security. This is an opportunity to work on problems that matter—with cutting-edge data, a highly collaborative team, and the scale of Microsoft behind you.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * Understand complex cybersecurity and business problems, translate them into well-defined data science problems, and build scalable solutions.\n * Design and build robust, large-scale graph structures to model security entities, behaviors, and relationships.\n * Develop and deploy scalable, production-grade AI/ML systems and intelligent agents for real-time threat detection, classification, and response.\n * Collaborate closely with Security Research teams to integrate domain knowledge into data science workflows and enrich model development.\n * Drive end-to-end ML lifecycle: from data ingestion and feature engineering to model development, evaluation, and deployment.\n * Work with large-scale graph data: create, query, and process it efficiently to extract insights and power models.\n * Lead initiatives involving Graph ML, Generative AI, and agent-based systems, driving innovation across threat detection, risk propagation, and incident response.\n * Collaborate closely with engineering and product teams to integrate solutions into production platforms.\n * Mentor junior team members and contribute to strategic decisions around model architecture, evaluation, and deployment.\n   \n   \n\nQualifications\n\n\n * Bachelor’s or Master’s degree in Computer Science, Statistics, Applied Mathematics, Data Science, or a related quantitative field\n * 6+ years of experience applying data science or machine learning in a real-world setting, preferably in security, fraud, risk, or anomaly detection\n * Proficiency in Python and/or R, with hands-on experience in data manipulation (e.g., Pandas, NumPy), modeling (e.g., scikit-learn, XGBoost), and visualization (e.g., matplotlib, seaborn)\n * Strong foundation in statistics, probability, and applied machine learning techniques\n * Experience working with large-scale datasets, telemetry, or graph-structured data Ability to clearly communicate technical insights and influence cross-disciplinary teams\n * Demonstrated ability to work independently, take ownership of problems, and drive solutions end-to-end\n   \n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "68 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1830452/Senior-Applied-Data-scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Marketing Analyst Manager",
  "location": "Gurgaon, Haryana, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-08-02",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-marketing-analyst-manager-at-google-4263533054?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in a research or quantitative field, or equivalent practical experience.\n * 7 years of experience designing, scoping, and executing research and analysis projects.\n * 7 years of experience translating business problems into research questions and translating research findings and insights into marketing recommendations.\n * Experience managing research and measurement agencies.\n   \n   \n\nPreferred qualifications:\n\n\n * 10 years of experience as a marketing analyst using statistical techniques.\n * 5 years of experience with statistical modeling and advanced measurement/analysis techniques (e.g., regression analysis, geo-experimentation, brand/conversion lift measurement, machine learning algorithms).\n * 5 years of experience with leading a team and people management.\n * Experience with data querying languages (e.g., SQL) and tools to work with large complex data sets, and programming languages (e.g., Python) to run analysis.\n * Experience in using data for storytelling and presenting complex research findings to both technical and non-technical audiences and using analytical insights to guide media planning.\n   \n   \n\nAbout The Job\n\nGoogle's leadership team hand-picks thorny business challenges, and members of BizOps work in small teams to find solutions. As part of this team you fully immerse yourself in data collection, draw insight from analysis, and then zoom out to develop compelling, synthesized recommendations. Taking strategy one step further, you also persuasively communicate your recommendations to senior-level executives, roll-up your sleeves to help drive implementation and check back-in to see the impact of your recommendations.\n\nResponsibilities\n\n\n * Lead a team of individuals, set and communicate team priorities that support organizational goals. Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals and meet regularly with individuals to discuss performance and development, and provide feedback and coaching.\n * Use your knowledge of data analytics to develop comprehensive strategies for marketing challenges, uncovering opportunities for measurement and optimization to drive incremental brand and performance growth.\n * Lead marketing-wide opportunities such as evaluating, launching and managing new tools and processes, driving cross-functional collaboration.\n * Build measurement plans and consolidate reporting metrics and benchmarks for our largest campaigns to understand the incremental impact of our marketing dollars.\n * Analyze campaign results and report the media effectiveness across all stakeholder groups and influence business decision-making through compelling use of data and impactful communication.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Sales, Advertising, and Marketing",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/108788988201837254-senior-marketing-analyst-manager/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Artificial Intelligence Engineer (English)",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-22",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-artificial-intelligence-engineer-english-at-google-4270785063?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science or related technical field, or equivalent practical experience.\n * Experience building data and AI solutions and working with technical customers.\n * Experience designing cloud enterprise solutions and supporting customer projects to completion.\n * Ability to communicate in English fluently to support client relationship management in this region.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience working with Large Language Models, data pipelines, and with data analytics, data visualization techniques.\n * Experience with core Data ETL techniques.\n * Experience in leveraging LLMs to deploy multimodal solutions encompassing Text, Image, Video and Voice.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ ELT and reporting/analytic tools and environments (Apache Beam, Hadoop, Spark, Pig, Hive, MapReduce, Flume).\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n   \n   \n\nAbout The Job\n\nThe Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners.\n\nAs a Cloud Engineer, you'll play a key role in ensuring that strategic customers have the best experience moving to the Google Cloud GenAI and Agentic AI suite of products. You will design and implement solutions for customer use cases, leveraging core Google products. You'll work with customers to identify opportunities to transform their business with GenAI, and deliver workshops designed to educate and empower customers to realize the full potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product issues, and address customer and partner needs. In this role, you will lead the timely execution of adopting the Google Cloud Platform solutions to the customer.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver effective big data and GenAI solutions and solve complex technical customer challenges.\n * Act as a trusted technical advisor to Google’s strategic customers.\n * Identify new product features and feature gaps, provide guidance on existing product challenges, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practices recommendations, tutorials, blog articles, and technical presentations adapting to different levels of key business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/141374000985973446-cloud-artificial-intelligence-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Engineer, AI",
  "location": "Gurugram, Haryana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-22",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-engineer-ai-at-google-4270556053?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurugram, Haryana, India; Bengaluru, Karnataka, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.\n * Experience building Machine Learning or Data Science solutions.\n * Experience writing software in Python, Scala, R, or similar.\n * Experience with data structures, algorithms, and software design.\n * Ability to travel up to 30% of the time.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience working with recommendation engines, data pipelines, or distributed machine learning, data analytics, data visualization techniques and software, and deep learning frameworks.\n * Experience in software development, professional services, solution engineering, technical consulting, architecting and rolling out new technology and solution initiatives.\n * Experience with core Data Science techniques.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ELT and reporting/analytic tools and environments.\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n * Excellent customer-facing communication and listening skills.\n   \n   \n\nAbout The Job\n\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\n\nAs a Cloud Engineer, you will play a key role in ensuring that customers have the best experience moving to the Google Cloud machine learning (ML) suite of products. You will design and implement machine learning solutions for customer use cases, leveraging core Google products. You will work with customers to identify opportunities to transform their business with machine learning, and will travel to customer sites to deploy solutions and deliver workshops designed to educate and empower customers to realize the full potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product code, and address customer and partner needs. In this role, you will lead the timely execution of adopting the Google Cloud Platform solutions to the customer’s requirements.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver effective big data and machine learning solutions and solve technical customer issues.\n * Act as a technical advisor to Google’s customers.\n * Identify new product features and feature gaps, provide guidance on existing product issues, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practice recommendations, tutorials, blog articles, and technical presentations adapting to different levels of key business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/107163409652294342-cloud-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Program Manager II, Google One",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-21",
  "jobUrl": "https://in.linkedin.com/jobs/view/program-manager-ii-google-one-at-google-4270514526?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science or equivalent practical experience.\n * 2 years of experience in program or project management.\n * Experience in stakeholder management or feature prioritization.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience in managing cross-functional or cross-team projects.\n * Experience in business generation, consumer product development with managing programs with third-party partners.\n * Experience in working on technical programs.\n * Excellent data analysis and dashboarding skills.\n   \n   \n\nAbout the jobA problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines. The Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.\n\nResponsibilities\n\n\n * Manage project schedules, identify risks and communicate them to project stakeholders.\n * Plan product or feature launches through the various stages like Alpha, Beta, General Availability. Coordinate with Product, Engineering, User Experience (UX), Marketing and other cross-functional stakeholders, including privacy, legal, partnerships, and support.\n * Evolve roadmap or launch planning and execution programs and processes.\n * Plan and collect data required to execute and govern programs. Maintain project trackers and status reports. Identify and execute on program tasks including managing dependencies.\n * Build relationships with program stakeholders, including managing expectations of program stakeholders and ensure they have the required insights for the decision-making process.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Strategy/Planning, and Other",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/133090203072897734-program-manager-ii/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Engineer, AI",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-22",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-engineer-ai-at-google-4270550432?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurugram, Haryana, India; Bengaluru, Karnataka, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.\n * Experience building Machine Learning or Data Science solutions.\n * Experience writing software in Python, Scala, R, or similar.\n * Experience with data structures, algorithms, and software design.\n * Ability to travel up to 30% of the time.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience working with recommendation engines, data pipelines, or distributed machine learning, data analytics, data visualization techniques and software, and deep learning frameworks.\n * Experience in software development, professional services, solution engineering, technical consulting, architecting and rolling out new technology and solution initiatives.\n * Experience with core Data Science techniques.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ELT and reporting/analytic tools and environments.\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n * Excellent customer-facing communication and listening skills.\n   \n   \n\nAbout The Job\n\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\n\nAs a Cloud Engineer, you will play a key role in ensuring that customers have the best experience moving to the Google Cloud machine learning (ML) suite of products. You will design and implement machine learning solutions for customer use cases, leveraging core Google products. You will work with customers to identify opportunities to transform their business with machine learning, and will travel to customer sites to deploy solutions and deliver workshops designed to educate and empower customers to realize the full potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product code, and address customer and partner needs. In this role, you will lead the timely execution of adopting the Google Cloud Platform solutions to the customer’s requirements.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver effective big data and machine learning solutions and solve technical customer issues.\n * Act as a technical advisor to Google’s customers.\n * Identify new product features and feature gaps, provide guidance on existing product issues, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practice recommendations, tutorials, blog articles, and technical presentations adapting to different levels of key business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/107163409652294342-cloud-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Scientist II, Tech",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 day ago",
  "publishedAt": "2025-08-09",
  "jobUrl": "https://in.linkedin.com/jobs/view/scientist-ii-tech-at-uber-4269553531?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About The Role\n\nThe Core Analytics & Science Team (CAS) is Uber's primary science organisation, covering both our main lines of business as well as the underlying platform technologies on which those businesses are built. We are a key part of Uber's cross-functional product development teams, helping to drive every stage of product development through data analytic, statistical, and algorithmic expertise. CAS owns the experience and algorithms powering Uber's global Mobility and Delivery products. We optimise and personalise the rider experience, target incentives and introduce customizations for routing and matching for products and use cases that go beyond the core Uber capabilities.\n\nWhat The Candidate Will Need / Bonus Points\n\n---- What the Candidate Will Do ----\n\n\n * Refine ambiguous questions and generate new hypotheses about the product through a deep understanding of the data, our customers, and our business\n * Design experiments and interpret the results to draw detailed and impactful conclusions.\n * Define how our teams measure success, by developing Key Performance Indicators and other users/business metrics, in close partnership with Product and other subject areas such as engineering, operations and marketing\n * Collaborate with applied scientists and engineers to build and improve on the availability, integrity, accuracy, and reliability of data logging and data pipelines.\n * Develop data-driven business insights and work with cross-functional partners to find opportunities and recommend prioritisation of product, growth, and optimisation initiatives.\n   \n   \n\nBasic Qualifications\n\n\n * Undergraduate and/or graduate degree in Math, Economics, Statistics, Engineering, Computer Science, or other quantitative fields.\n * 4+ years experience as a Product Analyst, Sr. Data Analyst, or other types of data analysis-focused functions\n * Excellent understanding of statistical principles backed by an academic foundation\n * Advanced SQL expertise\n * Experience with either Python or R for data analysis\n * Significant experience in setting up and evaluation of complex experiments\n * Proven track record to wrangle large datasets, extract insights from data, and summarise learnings/takeaways.\n * Experience with Excel and some dashboarding/data visualisation (i.e. Tableau, Mixpanel, Looker, or similar)\n   \n   \n\nPreferred Qualifications\n\n\n * Proven aptitude toward Data Storytelling and Root Cause Analysis using data\n * Ability to learn and adapt to new methodologies for data collection and analysis\n * Ability to deliver on tight timelines and prioritise multiple tasks while maintaining quality and detail\n * Ability to work in a self-guided manner\n * Ability to mentor, coach and develop junior team members\n * Superb communication and organisation skills",
  "applicationsCount": "120 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Internet Marketplace Platforms",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://tnl2.jometer.com/v2/job?jz=5wqzs34c6eb29f7b502ecd714b2fb655efa31M4ALBBQAAADQ&iis=Job%20Board%20-%20Recruitment%20Marketing&iisn=LinkedIn",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Sr Product Manager, Uber Eats",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "3 weeks ago",
  "publishedAt": "2025-07-14",
  "jobUrl": "https://in.linkedin.com/jobs/view/sr-product-manager-uber-eats-at-uber-4266573298?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About the Role\n\n\n\n\n\n\n\nMerchant Product Org at Uber Eats has the vision of building the most preferred online delivery platform for merchants globally. This team helps build great experiences for Merchants across their entire lifecycle in running an online food delivery business. We are looking for a seasoned Product Manager to drive product-led growth initiatives for merchants to grow their business on Uber Eats by providing them the right technology tools and intelligence. In this role, you will be building products for heterogenous segments of merchants ranging from Large Enterprises (established food chains) to small independent restaurants globally.\n\n\n\n\n\n\n\n\n\n---- What the Candidate Will Do ----\n\n\n\n\n * Define the overall product strategy, goals, and roadmap to drive merchant growth\n * Partner closely with engineering, dats science, design, user research, and product operations teams to build user-centric product with a high bar on quality\n * Collaborate with operations, product marketing, global account management teams to define theGTM strategy and drive execution. Monitor product performance, learn and iterate.\n * Clearly communicate product plans, impact, and trade-offs to a wide spectrum of audiences, including partner teams and senior leadership teams.\n\n\n\n\n\n\n\n---- Basic Qualifications ----\n\n\n\n\n * Bachelor's degree in engineering, business management, or equivalent\n * 8+ years of overall experience with 6+ years as a product manager with a strong track record of creating impact at scale in product driven companies\n * Demonstrated experience of working cross-functionally with engineering, design, data science, and operations stakeholders to solve complex user-facing problems\n * Experience in independently framing high visibility OKRs, building 6-12 month product roadmaps, and driving execution for a product charter of moderate to high ambiguity\n\n\n\n\n\n\n\n---- Preferred Qualifications ----\n\n\n\n\n * Experience of building products in an online marketplace business (e-commerce, food delivery, etc.) and/or building products for small businesses\n * Experience of working in a fast-paced global product company\n * Experience of building products at large scale (100M+ user base)\n\n",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Product Management",
  "sector": "Internet Marketplace Platforms and Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://in.linkedin.com/jobs/view/sr-product-manager-uber-eats-at-uber-4266573298?trk=public_jobs_topcard-title",
  "applyType": "EASY_APPLY",
  "benefits": ""
},
{
  "title": "Engineering Analyst, Payments, Trust and Safety",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-08-01",
  "jobUrl": "https://in.linkedin.com/jobs/view/engineering-analyst-payments-trust-and-safety-at-google-4277943425?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience in data analysis, including identifying trends, generating summary statistics, and drawing insights from quantitative and qualitative data.\n * 2 years of experience managing projects and defining project scope, goals, and deliverables.\n   \n   \n\nPreferred qualifications:\n\n\n * Master's degree in a quantitative discipline.\n * 2 years of experience with one or more of the following languages: SQL, R, Python, or C++.\n * 2 years of experience with machine learning systems.\n * Excellent written and verbal communication skills.\n   \n   \n\nAbout The Job\n\nTrust & Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.\n\nIn this role, you will work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed, in order to ensure a safe and secure Payments ecosystem for our users. You will identify and solve complex problems and have investigative and technical skills to innovate and optimize our processes and tools. You are proactive, motivated, organized, reliable, innovative and will work well in a fast-moving, global, cross-functional, and team-oriented environment.\n\nAt Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.\n\nResponsibilities\n\n\n * Investigate fraud and abuse incidents, identify patterns and trends in order to generate holistic risk management solutions. Promote user trust and safety by managing and mitigating payment fraud, scams and abuse on Google products and services.\n * Perform statistical analysis using payments and risk data warehouse, collaborate with Engineering and Product teams to create and enhance tools, develop signals, improve system functionality, accuracy and efficiency.\n * Lead projects through the full project life-cycle that require cross-functional stakeholder management using technical expertise to drive and implement automation opportunities.\n * Perform end-to-end assessment of the associated risk and vulnerability of products and features. Respond to escalations from internal and external parties within designated service levels.\n * Perform on-call responsibilities on a rotating basis, including weekend coverage.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "96 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "General Business, Strategy/Planning, and Consulting",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/104145118163804870-engineering-analyst/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Cloud Artificial Intelligence Engineer",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "3 days ago",
  "publishedAt": "2025-08-07",
  "jobUrl": "https://in.linkedin.com/jobs/view/cloud-artificial-intelligence-engineer-at-google-4267996819?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Pune, Maharashtra, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science or a related technical field, or equivalent practical experience.\n * 3 years of experience in building data and Artificial Intelligence (AI) solutions and working with technical customers.\n * Experience in designing cloud enterprise solutions and supporting customer projects to completion.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience in working with Large Language Models, data pipelines, and with data analytics, data visualization techniques.\n * Experience with Data Extract, Transform, and Load (ETL) techniques.\n * Experience in Large Language Models (LLMs) to deploy multimodal solutions involving Text, Image, Video and Voice.\n * Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, Extract, Transform, and Load/Extract, Load and Transform and investigative tools and environments (e.g., Apache Beam, Hadoop, Spark, Pig, Hive, MapReduce, Flume).\n * Knowledge of cloud computing, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.\n * Excellent communication skills.\n   \n   \n\nAbout the jobThe Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners.\n\nIn this role, you will play a role in ensuring that customers have the quality experience moving to the Google Cloud Generative AI (GenAI) and Agentic AI suite of products. You will design and implement solutions for customer use cases, leveraging core Google products. You will work with customers to identify opportunities to transform their business with Generative AI (GenAI), and deliver workshops designed to educate and empower customers to realize the potential of Google Cloud. You will have access to Google’s technology to monitor application performance, debug and troubleshoot product issues, and address customer and partner needs. You will lead the execution of adopting the Google Cloud Platform solutions to the customer.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Deliver big data and GenAI solutions and solve technical customer tests.\n * Act as a trusted technical advisor to Google’s customers.\n * Identify new product features and feature gaps, provide guidance on existing product tests, and collaborate with Product Managers and Engineers to influence the roadmap of Google Cloud Platform.\n * Deliver best practices recommendations, tutorials, blog articles, and technical presentations adapting to different levels of business and technical stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "145 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Project Management, Consulting, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/104570819216057030-cloud-artificial-intelligence-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Search Specialist, Ads Solutions",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-30",
  "jobUrl": "https://in.linkedin.com/jobs/view/search-specialist-ads-solutions-at-google-4263167970?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India.Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring campaigns and providing client solutions.\n   \n   \n\nPreferred qualifications:\n\n\n * 3 years of experience with Internet products and technologies.\n * Experience in data analysis, with the ability to interpret datasets, identify trends, and translate findings into compelling narratives.\n * Knowledge of apps platforms and products, the performance advertising market, or online ads landscape.\n * Ability to collaborate cross-functionally with multiple teams and stakeholders while building relationships.\n * Excellent project management skills, with the ability to oversee multiple, simultaneous solutions, supported by internal teams.\n * Excellent business communication, negotiation, and influencing skills.\n   \n   \n\nAbout The Job\n\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\n\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video .\n\nResponsibilities\n\n\n * Advise key Google Ads clients, leveraging digital marketing and tech solutions to address business issues, collaborate as a thought partner, design media plans, and deliver technical solutions to achieve business goals.\n * Build relationships with external advertisers to deliver business outcomes through Google Ads, supporting planning, pitching, implementation, and optimization to boost product adoption and business growth.\n * Collaborate with teams to drive growth plans for clients, develop and apply insights for vertical and sub-verticals in solutions offered.\n * Deliver consultative digital marketing solutions that address issues and enhance the customer's experience.\n * Advocate new product features, assist with adoption through setup, and provide technical guidance for infrastructure and data integration in Google Ads.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, General Business, and Customer Service",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/72864703306441414-search-specialist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Science Manager, gTech Ads Solutions",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 day ago",
  "publishedAt": "2025-08-09",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-science-manager-gtech-ads-solutions-at-google-4269041490?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Bengaluru, Karnataka, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Master's degree in a quantitative discipline such as Statistics, Engineering, Sciences, or equivalent practical experience.\n * 9 years of experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis.\n * 3 years of experience as a people manager within a technical leadership role.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience in leading and evolving data science and engineering teams with technical strengths.\n * Experience preparing and delivering presentations to executive leadership.\n * Ability to operate in a cross-functional organization where collaboration with other teams is essential to our team's success.\n * Ability to adept at distilling analyses into data driven narratives.\n * Excellent communication skills, especially in communicating technical and statistical concepts clearly and concisely among audiences at different levels.\n   \n   \n\nAbout the jobAs a Data Science Manager in the Measurement Center of Excellence, you will lead a team of technical experts, utilizing Google’s Machine Learning capabilities to build data science and measurement solutions to our Large Customer Sales (LCS) clients. You will closely collaborate with clients, agencies and internal teams.\n\nIn this role, you will be responsible for leading a team of data scientists in applying best data science practices to solve our ads customers’ problems in marketing. You will be responsible for building and executing gTech’s strategy and outlook to deliver applied data science to Google's largest ads customers, utilizing the best of Google’s Machine Learning capabilities to build innovative solutions that address our customer's problem-space.\n\nResponsibilities\n\n\n * Lead a team of Data Scientists responsible for delivering data science aspects of client engagements in the area of marketing effectiveness and marketing portfolio management.\n * Develop a data science roadmap for your team that aligns with Data Science strategy and Objectives and Key Results (OKRs). Establish project goals, align individuals' expectations, coordinate resources, and provide technical leadership in-line with the long-term objectives.\n * Provide analytical thought leadership in the areas of Data Science and Measurement through proactive and strategic contributions.\n * Influence stakeholders through effective presentations and written communication.\n * Collaborate with Product/Engineering teams to increase and optimize capabilities of the Applied Data Science team, employing methods which create opportunities for scale, and help to drive innovation.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "142 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Information Technology and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/73820612165804742-data-science-manager/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Product Manager, AI CoPilot for Customer Support",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-23",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-product-manager-ai-copilot-for-customer-support-at-uber-4270953322?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About the Role\n\n\n\n\n\nAs a Senior Product Manager for Customer Obsession, you will be part of the team that's responsible for delivering exceptional customer experiences across mobile and web for Riders, Drivers, Eaters, and Businesses using Uber. You will be using best of breed technologies, and latest machine learning, data science techniques, and design thinking to accomplish this at a scale that has never been done before in the industry.\n\n\n\n\n\n\n\n\n\n---- What the Candidate Will Do ----\n\n\n\n\n * Lead product strategy and development of the Agent Platform charter owning the internal CRM solution along with the Agent Assist suite of capabilities\n * Work closely with a substantial global community operations organization to integrate business processes and policies onto the platform\n * Collaborate with design team and guide their investments for research, prototyping, experimentation, and overall design thinking\n * Be incredibly truth-seeking. Collect whatever data is necessary to inform product direction, whether in the form of competitive intel, rider behavior or other business metrics. Solicit and welcome critical feedback.\n * Drive innovation, definition, deliverables planning (roadmap) and design of entirely new Uber products and product features to deliver against team and company goals. Requires challenging all members of cross-functional team (engineering, design, etc.) to think boldly and creatively and then to funnel that energy into concrete products and execution plans.\n * Make tradeoff decisions based on technical and business insights and experimentation\n * Monitor and measure launched products and feed insights back into product development process to drive growth\n * Clearly communicate product plans, benefits and results, as appropriate, to a spectrum of audiences, from internal stakeholders to Uber executives, employees to riders.\n\n\n\n\n\n\n\n---- Basic Qualifications ----\n\n\n\n\nThis role demands real passion for the customer, great technical depth, principled thinking, well-honed product judgment, a stubborn refusal to settle, bold innovation, a high design bar and a mentality of starting with the customer first and working backwards\n\n * A computer science undergraduate degree or other engineering degree equivalent.\n * 7+ years of product experience delivering highly successful and innovative products or platforms.\n * Data-driven decision-making ability.\n * Design thinking and customer-centric approach to building, experimenting, and iterating products\n * A \"driver\" personality - constantly pushing toward clarity and delivery while balancing the need for great collaboration.\n * High standards across the board - from your own contributions to the people you work with to the products you work on.\n * Grittiness: You don't hesitate to take initiative and address something hands-on, you persevere when others give up.\n * Passion for Uber's mission and the company's hybrid technology/operations nature.\n * A deep desire to grow and learn.\n\n\n\n\n\n\n\n---- Preferred Qualifications ----\n\n\n\n\n * MBA or Masters degreed\n * Experience working with internal or SaaS Customer Relation Management\n * Experience working with LLM powered co-pilot, agent assist capabilities\n\n",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Product Management",
  "sector": "Internet Marketplace Platforms",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://in.linkedin.com/jobs/view/senior-product-manager-ai-copilot-for-customer-support-at-uber-4270953322?trk=public_jobs_topcard-title",
  "applyType": "EASY_APPLY",
  "benefits": ""
},
{
  "title": "Search Specialist, Ads Solutions",
  "location": "Gurugram, Haryana, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-30",
  "jobUrl": "https://in.linkedin.com/jobs/view/search-specialist-ads-solutions-at-google-4263166971?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India.Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring campaigns and providing client solutions.\n   \n   \n\nPreferred qualifications:\n\n\n * 3 years of experience with Internet products and technologies.\n * Experience in data analysis, with the ability to interpret datasets, identify trends, and translate findings into compelling narratives.\n * Knowledge of apps platforms and products, the performance advertising market, or online ads landscape.\n * Ability to collaborate cross-functionally with multiple teams and stakeholders while building relationships.\n * Excellent project management skills, with the ability to oversee multiple, simultaneous solutions, supported by internal teams.\n * Excellent business communication, negotiation, and influencing skills.\n   \n   \n\nAbout The Job\n\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\n\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video .\n\nResponsibilities\n\n\n * Advise key Google Ads clients, leveraging digital marketing and tech solutions to address business issues, collaborate as a thought partner, design media plans, and deliver technical solutions to achieve business goals.\n * Build relationships with external advertisers to deliver business outcomes through Google Ads, supporting planning, pitching, implementation, and optimization to boost product adoption and business growth.\n * Collaborate with teams to drive growth plans for clients, develop and apply insights for vertical and sub-verticals in solutions offered.\n * Deliver consultative digital marketing solutions that address issues and enhance the customer's experience.\n * Advocate new product features, assist with adoption through setup, and provide technical guidance for infrastructure and data integration in Google Ads.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, General Business, and Customer Service",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/72864703306441414-search-specialist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Science Manager, gTech Ads Solutions",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "1 day ago",
  "publishedAt": "2025-08-09",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-science-manager-gtech-ads-solutions-at-google-4269042475?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Bengaluru, Karnataka, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\n * Master's degree in a quantitative discipline such as Statistics, Engineering, Sciences, or equivalent practical experience.\n * 9 years of experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis.\n * 3 years of experience as a people manager within a technical leadership role.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience in leading and evolving data science and engineering teams with technical strengths.\n * Experience preparing and delivering presentations to executive leadership.\n * Ability to operate in a cross-functional organization where collaboration with other teams is essential to our team's success.\n * Ability to adept at distilling analyses into data driven narratives.\n * Excellent communication skills, especially in communicating technical and statistical concepts clearly and concisely among audiences at different levels.\n   \n   \n\nAbout the jobAs a Data Science Manager in the Measurement Center of Excellence, you will lead a team of technical experts, utilizing Google’s Machine Learning capabilities to build data science and measurement solutions to our Large Customer Sales (LCS) clients. You will closely collaborate with clients, agencies and internal teams.\n\nIn this role, you will be responsible for leading a team of data scientists in applying best data science practices to solve our ads customers’ problems in marketing. You will be responsible for building and executing gTech’s strategy and outlook to deliver applied data science to Google's largest ads customers, utilizing the best of Google’s Machine Learning capabilities to build innovative solutions that address our customer's problem-space.\n\nResponsibilities\n\n\n * Lead a team of Data Scientists responsible for delivering data science aspects of client engagements in the area of marketing effectiveness and marketing portfolio management.\n * Develop a data science roadmap for your team that aligns with Data Science strategy and Objectives and Key Results (OKRs). Establish project goals, align individuals' expectations, coordinate resources, and provide technical leadership in-line with the long-term objectives.\n * Provide analytical thought leadership in the areas of Data Science and Measurement through proactive and strategic contributions.\n * Influence stakeholders through effective presentations and written communication.\n * Collaborate with Product/Engineering teams to increase and optimize capabilities of the Applied Data Science team, employing methods which create opportunities for scale, and help to drive innovation.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "102 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Information Technology and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/73820612165804742-data-science-manager/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Software Engineer 2 - Machine Learning Engineer",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 days ago",
  "publishedAt": "2025-08-08",
  "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-2-machine-learning-engineer-at-microsoft-4282127153?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "The Microsoft CoreAI Post-Training team is dedicated to advancing post-training techniques for both OpenAI and open-source models. Our work spans continual pre-training, fine-tuning, reinforcement learning at scale, and data curation. We contribute to both research and product development across Microsoft.\n\nWe build and deploy cutting-edge AI technologies that integrate language and multi-modality into Microsoft products. Our team is especially active in developing code-focused models, such as those powering GitHub Copilot and Visual Studio Code.\n\nWe are looking for a Machine Learning Engineer with a strong foundation in ML systems and a passion for deploying large-scale models in production. This role is ideal for someone who has experience working with LLMs or multimodal models and is eager to grow their expertise in building scalable, reliable ML infrastructure.\n\nResponsibilities\n\nResponsibilities\n\n\n * Collaborate with senior engineers and researchers to build and optimize training and inference pipelines for LLMs, SLMs, multimodal, and code-specific models.\n * Contribute to the deployment and monitoring of models in production environments.\n * Write clean, efficient, and maintainable code for ML systems.\n * Help improve inference performance, reliability, and scalability.\n * Participate in rapid experimentation cycles and support integration with Microsoft products.\n   \n   \n\nQualifications\n\nRequired Qualifications\n\n\n * Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field, or equivalent practical experience.\n * 2+ years of experience with Python and ML frameworks such as PyTorch or TensorFlow.\n * Hands-on experience with training or fine-tuning LLMs or multimodal models.\n * Familiarity with production ML systems and concepts like model serving, caching, batching, and monitoring.\n * Understanding of distributed systems and cloud-based infrastructure.\n   \n   \n\nPreferred Qualifications\n\n\n * Experience with containerization tools (e.g., Docker, Kubernetes).\n * Exposure to MLOps or DevOps practices (CI/CD, automated testing, deployment).\n * Interest in generative AI and open-source model ecosystems.\n * Ability to work in a fast-paced, collaborative environment with a growth mindset.\n * Strong communication and documentation skills.\n   \n   \n\n#AI Platform Hiring#\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1856700/Software-Engineer-2-Machine-Learning-Engineer?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Data Scientist Product, Google One and Photos",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-24",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-data-scientist-product-google-one-and-photos-at-google-4231208455?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, a related quantitative field, or equivalent practical experience.\n * 8 years of work experience using analytics to solve product or business problems, performing statistical analysis, and coding (e.g., Python, R, SQL) (or 5 years work experience with a Master's degree).\n   \n   \n\nPreferred qualifications:\n\n\n * Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\n * 8 years of work experience using analytics to solve product or business problems, performing statistical analysis, and coding (e.g., Python, R, SQL).\n   \n   \n\nAbout The Job\n\nHelp serve Google's worldwide user base of more than a billion people. Data Scientists provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make critical recommendations for your fellow Googlers in Engineering and Product Management. You relish tallying up the numbers one minute and communicating your findings to a team leader the next.\n\nGoogle One is a premium subscription to Google, delivering expanded storage, premium features, and AI-powered experiences across Google products to members. The team partners with teams across Google to deliver experiences to users that drive engagement and enhance loyalty, translating into subscription business growth.\n\nResponsibilities\n\n\n * Partner with product managers and Engineering and other folks in Analytics to understand the profile of Google One business, use data to evaluate how business is evolving, and drive decisions based on insights.\n * Identify business problems and come up with analytical solutions that improve product and user experience.\n * Perform analysis utilizing relevant tools (e.g., SQL, R, Python) and help solve problems, and take ownership of open-ended ambiguous business problems to reach an optimal solution.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Product Management and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/89391408695124678-senior-data-scientist-product/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Data Scientist",
  "location": "Noida, Uttar Pradesh, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-31",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-data-scientist-at-microsoft-4278533182?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "Microsoft’s Cloud business is expanding, and the Cloud Supply Chain (CSCP) organization is responsible for enabling the hardware infrastructure underlying this growth including AI! CSCP’s vision is to empower customers to achieve more by delivering Cloud and AI capabilities at scale. Our mission is to deliver the world's computer with an industry-leading supply chain. The CSCP organization is responsible for traditional supply chain functions such as plan, source, make, deliver, but also manages supportability (spares), sustainability, and decommissioning of datacenter assets worldwide. We deliver the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, OneDrive and the Microsoft Azure platform for external customers. Our infrastructure is supported by more than 300 datacenters around the world that enable services for more than 1 billion customers in over 90 countries.\n\nMicrosoft Cloud Planning (MCP) is the central planning function within CSCP focused on forecasting, demand planning, and supply planning for all Microsoft Cloud services and associated hardware, directly impacting the success of Microsoft's cloud business.\n\nResponsibilities\n\n\n * Researching and developing production-grade models (forecasting, anomaly detection, optimization, clustering, etc.) for our global cloud business by using statistical and machine learning techniques.\n * Manage large volumes of data, and create new and improved solutions for data collection, management, analyses, and data science model development.\n * Drive the onboarding of new data and the refinement of existing data sources through feature engineering and feature selection.\n * Apply statistical concepts and cutting-edge machine learning techniques to analyze cloud demand and optimize our data science model code for distributed computing platforms and task automation.\n * Work closely with other data scientists and data engineers to deploy models that drive cloud infrastructure capacity planning.\n * Present analytical findings and business insights to project managers, stakeholders, and senior leadership and keep abreast of new statistical / machine learning techniques and implement them as appropriate to improve predictive performance.\n * Oversees and directs the plan or forecast across the company for demand planning. Evangelizes the demand plan with other leaders.\n * Drives clarity and understanding of what is required to achieve the plan (e.g., promotions, sales resources, collaborative planning, forecasting, and replenishment [CPFR], budget, engineering changes) and assesses plans to mitigate potential risks and issues.\n * Oversees the analysis of data and leads the team in identifying trends, patterns, correlations, and insights to develop new forecasting models and improve existing models.\n * Oversees development of short and long term (e.g., weekly, monthly, quarterly) demand forecasts and develops and publishes key forecast accuracy metrics. Analyzes data to identify potential sources of forecasting error. Serves as an expert resource and leader of demand planning across the company and ensures that business drivers are incorporated into the plan (e.g., forecast, budget).\n * Leads collaboration among team and leverages data to identify pockets of opportunity to apply state-of-the-art algorithms to improve a solution to a business problem.\n * Consistently leverages knowledge of techniques to optimize analysis using algorithms.\n * Modifies statistical analysis tools for evaluating Machine Learning models. Solves deep and challenging problems for circumstances such as when model predictions are not correct, when models do not match the training data or the design outcomes when the data is not clean when it is unclear which analyses to run, and when the process is ambiguous.\n * Provides coaching to team members on business context, interpretation, and the implications of findings. Interprets findings and their implications for multiple businesses, and champions methodological rigor by calling attention to the limitations of knowledge wherever biases in data, methods, and analysis exist.\n * Generates and leverages insights that inform future studies and reframe the research agenda. Informs both current business decisions by implementing and adapting supply-chain strategies through complex business intelligence.\n * Connects across functional teams and the broader organization outside of Demand Planning to advocate for continuous improvement and maintain best practices.\n   \n   \n\nLeads broad governance and rhythm of the business processes that ensure cross-group collaboration, discussion of key issues, and an opportunity to build proposed solutions to address current or future business needs.\n\nQualifications\n\nRequired:\n\n\n * M.Sc. in Statistics, Applied Mathematics, Applied Economics, Computer Science or Engineering, Data Science, Operations Research or similar applied quantitative field\n * 4-8 years of industry experience in developing production-grade statistical and machine learning code in a collaborative team environment.\n * Prior experience in machine learning using R or Python (scikit / numpy / pandas / statsmodel).\n * Prior experience in time series forecasting.\n * Prior experience with typical data management systems and tools such as SQL.\n * Knowledge and ability to work within a large-scale computing or big data context, and hands-on experience with Hadoop, Spark, DataBricks or similar.\n * Excellent analytical skills; ability to understand business needs and translate them into technical solutions, including analysis specifications and models.\n * Creative thinking skills with emphasis on developing innovative methods to solve hard problems under ambiguity and no obvious solutions.\n * Good interpersonal and communication (verbal and written) skills, including the ability to write concise and accurate technical documentation and communicate technical ideas to non-technical audiences.\n   \n   \n\nPreferred\n\n\n * PhD in Statistics, Applied Mathematics, Applied Economics, Computer Science or Engineering, Data Science, Operations Research or similar applied quantitative field.\n * Experience in machine learning using R or Python (scikit / numpy / pandas / statsmodel) with skill level at or near fluency.\n * Experience with deep learning models (e.g., tensorflow, PyTorch, CNTK) and solid knowledge of theory and practice.\n * Practical and professional experience contributing to and maintaining a large code base with code versioning systems such as Git.\n * Knowledge of supply chain models, operations research techniques, optimization modelling and solvers.\n   \n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "133 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1846341/Senior-Data-Scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Product Manager, Feature Engineering",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-29",
  "jobUrl": "https://in.linkedin.com/jobs/view/product-manager-feature-engineering-at-google-4262152624?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 5 years of experience in product management or related technical role.\n * 3 years of experience developing or launching infrastructure products or technologies within networking, storage, compute hardware, databases, file systems, data analytics, cluster management, and other software infrastructure areas.\n   \n   \n\nPreferred qualifications:\n\n\n * Master's degree in a technology or business related field.\n * 2 years of experience in software development working cross-functionally with engineering, UX/UI, sales and finance teams.\n * Experience with cloud-based data platforms.\n * Understanding of AI/ML concepts, including machine learning algorithms, model training, and deployment.\n * Understanding of data architectures, data warehousing, data lakes, and data pipelines.\n   \n   \n\nAbout The Job\n\nAt Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day.\n\nIn this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development.\n\nOne of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information. We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users.\n\nResponsibilities\n\n\n * Define and deliver a product outlook and road-map for data platforms that empower AI/ML innovation.\n * Lead the discovery and development of new data products and features that address the evolving needs of data scientists, machine learning engineers, and researchers.\n * Collaborate with engineering, data science, and research teams to translate business needs into technical requirements and prioritize initiatives.\n * Conduct market research and analysis to identify trends and opportunities in the data and AI/ML space.\n * Communicate with stakeholders, including engineers, data scientists, executives, and customers.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Product Management and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/114699986871952070-product-manager/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Operations Lead, Trust and Safety",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-30",
  "jobUrl": "https://in.linkedin.com/jobs/view/operations-lead-trust-and-safety-at-google-4262859742?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 10 years of experience in data analytics, Trust and Safety, policy, cyber-security, business strategy, or related fields.\n   \n   \n\nPreferred qualifications:\n\n\n * 14 years of experience in operations, Trust and Safety.\n * 10 years of experience in people management, supervision, or team leadership, leading large teams and 5 years of experience driving process improvement.\n * Experience in Trust and Safety or developer relations with the ability to identify risks and develop compliance solutions.\n * Knowledge of content moderation, policy enforcement, and customer support.\n * Ability to drive operational improvements, including tool creation, process roadmaps, quantitative analysis, and efficiency identification.\n * Excellent communication skills and ability to prepare and present goals to executives.\n   \n   \n\nAbout the jobTrust and Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you're a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.\n\nResponsibilities\n\n\n * Take responsibility for running the support operations and ensuring adherence to key metrics.\n * Lead the formulation and execution of training and support for review teams, driving process improvements for operational scale and quality.\n * Collaborate with Content and Artificial Intelligence (AI) Policy leads on program implementation, managing risks and developing roadmaps for adoption across teams.\n * Work cross-functionally to improve developer experience by gathering insights, driving projects to enhance policy experiences and enable compliance.\n * Lead analysis of support features, building tracking and reporting mechanisms to deliver data-driven insights and recommendations to stakeholders.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "General Business, Strategy/Planning, and Consulting",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/100649362140340934-operations-lead/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Sr Product Manager - Uber Connect",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-31",
  "jobUrl": "https://in.linkedin.com/jobs/view/sr-product-manager-uber-connect-at-uber-4275943361?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "As a Product Manager on Uber Connect (Courier), you will be building one of Uber’s fastest growing independent lines of business that allows any consumer around the world to access Uber’s best in class logistics network. Consumers and small businesses alike can access our delivery platform for any use case ranging from picking up that jacket you left at your friends place to helping SMBs deliver their retail orders to the post office.\n\n\n\nIn this role, you will be responsible for driving growth and attracting users to our app by creating awareness, engaging, impactful experiences that clearly communicate its value. You will play a crucial role in expanding Connect's reach, focusing on areas like awareness and Small and Medium-sized Businesses (SMBs). This position will require you to work with a broad set of cross-functional stakeholders across business development, sales, operations, data science, design, engineering, and more.\n\n\n\n\n\n---- What the Candidate Will Do ----\n\n\n\n\nThe Uber Connect (Courier) world is vast and we are only just getting started. This is a representative sampling of the areas you might be tackling on the team:\n\n 1. Leading and executing marketing functions including brand, SEO, CRM, and local initiatives to drive awareness and consideration.\n 2. Optimizing in-app awareness and improving search ranking to enhance user discoverability and engagement.\n 3. Managing retargeting campaigns, promotions, and referral programs to acquire new users and foster retention.\n 4. Working to attract users to the app by creating engaging and impactful experiences that clearly communicate Connect's value proposition.\n 5. Designs, executes, and analyzes A/B, multivariate, and incrementality tests to identify growth drivers\n\n\n\n\n\n\n\n\n\n---- Basic Qualifications ----\n\n\n\n\n 1.  Minimum 5+ years pure product management experience delivering successful and innovative products with your fingerprints all over them\n 2.  Technical savviness. Can manifest in different ways: hands-on software engineering experience, or experiences building complex software products side by side with engineers.\n 3.  Attention to detail. The ability to obsess over every single part of the food-making process\n 4.  Customer obsession. The ability to take on complex product challenges and find elegant, simplifying solutions to avoid making them our users and partner’s problems\n 5.  Finger-tippiness with data. You find a way to get the data you need and whip it into an insightful story with no help. You know how to leverage this data to make decisions without getting stuck in analysis paralysis\n 6.  A “Driver” mindset. You are biased toward action, a great collaborator, a master disambiguator/simplifier, and constantly pushing toward clarity and delivery\n 7.  Grittiness. You never hesitate to roll up your sleeves and tackle something hands-on\n 8.  A high bar across the board — from your own contributions to the people you work with, to the products you work on\n 9.  A true passion for Uber’s mission, our products, and the company’s hybrid technology/operations nature\n 10. A never-ending desire to grow and learn\n\n\n\n\n\n\n\n\n\n---- Preferred Qualifications ----\n\n\n\n\n 1. Proven track record of building products from 0-1\n 2. Experience in creating consumer-facing products, with a strong understanding of the challenges and requirements involved in delivering products on a global scale.\n 3. Strong analytical and experimentation background\n 4. Owning and leading strategy for line of business\n\n",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Product Management",
  "sector": "Internet Marketplace Platforms",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://in.linkedin.com/jobs/view/sr-product-manager-uber-connect-at-uber-4275943361?trk=public_jobs_topcard-title",
  "applyType": "EASY_APPLY",
  "benefits": ""
},
{
  "title": "Senior Applied Scientist",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-25",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-applied-scientist-at-microsoft-4275647946?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "How would you like to directly affect the lives of billions of humans? Would you like to be responsible for models and code running across tens of thousands of machines across datacenters around the world? What if you could multiply your impact by making developers around the world better? If you like building highly motivated and productive teams, we have got interesting opportunities for you.\n\nWho we are \n\nOur team focuses on strategic workloads like M365 Copilot App, Outlook, Teams, Copilot Extensibility, and all productivity applications in M365.  The team obsesses about powering workloads with AI and innovates on next generation engineering infrastructure, tooling using AI. This provides every engineer with exceptional opportunities for rich learning, end-to-end ownership, autonomy, innovation and professional growth. \n\n \n\nOur team of Senior Applied Scientists is chartered to tackle a wide variety of challenges, from building data ingestion to curating data to fine tuning prompts and models.  The scientists focus on evaluation metrics to make purpose-built SLMs to infuse AI in productivity scenarios. Every member of this team is expected to collaborate with other teams across Microsoft that are building AI platforms, models and products. She is expected to lead the feature crews with a growth mindset for embracing and extending the rapidly evolving innovations and breakthroughs in this field.  \n\n \n\nMicrosoft is committed to Responsible AI and digital safety for all. Every member of the team is expected to work through these frameworks to preserve our commitment to responsible AI while innovating rapidly. She needs to be self-driven, proactive, results-oriented and ready to work with minimal ongoing direction to succeed in this environment of rapid changes and building products from grounds up. \n\n \n\nAbout The Org\n\nThe M365 org plays a pivotal role in powering end user experiences (copilots and beyond) powered by highly relevant search capability leveraging M365 eco system.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * You will master one or more subareas and gain expertise in a broad area of research, including applicable research techniques. You’ll also gain deep knowledge of a service, platform, or domain, and identify product needs by sharing the latest industry trends and applied technologies.\n * You will review business requirements and incorporate research to meet business goals. You‘ll provide strategic direction for the kinds of data used to solve problems and apply deep subject matter knowledge to support business impact.\n * You will participate in onboarding of junior team members and assist in developing academics to be members of multidiscipline teams. You’ll identify new research talent to join Microsoft and collaborate with the academic community to develop the recruiting pipeline.\n * You will document work in progress and experimentation results and share findings to promote innovation. You’ll also use your deep understanding of fairness and bias to contribute to ethics and privacy policies related to research processes and data collection.\n   \n   \n\nQualifications\n\nRequired Qualifications:\n\n\n * Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics predictive analytics, research)\n    * OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research)\n    * OR equivalent experience.\n\n * 3+ years of working in an AI research facility or working with software services / experiences infused with AI. \n * Solid customer focus and passion for doing the right thing for the customer.\n * Proven ability to establish trusted, effective relationships across diverse sets of stakeholders.\n * Excellent communication skills and cross group collaboration.\n * Ability to keep pace with rapid innovations in the field and to be creative to solve problems with no past techniques.\n * Experience in developing / working with highly scalable classifiers, ranking algorithms, SLMs, LLMs, Finetuning with RLHF, etc. will be a plus.\n   \n\nPreferred Qualifications\n\n\n * Master’s degree with Computer Science with Data Science focus, Mathematics, Statistics, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) \n    * OR Bachelor’s degree with Computer Science with Data Science focus, Mathematics, Statistics, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) \n    * OR equivalent experience.\n      \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "51 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1822320/Senior-Applied-Scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Machine Learning Engineer",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "4 days ago",
  "publishedAt": "2025-08-05",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-machine-learning-engineer-at-microsoft-4280422036?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "We are building a planet-scale multi-modal database from the ground up. You will be part of the team that is reimagining the databases in the era of Large Language Models (LLMs) by deeply integrating Artificial Intelligence (AI) into all parts of the stack.\n\nAs a Senior Machine Learning Engineer, you will collaborate with a team of passionate engineers, driving ideas to impactful results in a fast-paced environment. You will work on designing, building, and deploying large-scale machine learning systems, with an emphasis on production-grade solutions involving data pipelines, distributed training, model serving, and performance optimization. You are experienced in machine learning engineering from ideation and algorithm selection, to architecture and implementation, to deployment and continuous improvement.\n\nSuccessful engineers in our team have problem solving, design, coding and debugging skills, drive for execution and results, rigor in delivering quality software and a desire for continuous learning. Our team values a friendly, collaborative atmosphere with a passion for technology, and we believe that a diverse team with diverse perspectives that applies empathy and uses great communication skills helps deliver superior products and is key to success. This is a great opportunity to challenge yourself, grow your career, and influence the next generation of computing at Microsoft.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nResponsibilities\n\n\n * Develop and deploy scalable Machine Learning models.\n * Develop robust evaluation frameworks to assess model performance, conduct systematic benchmarking, and address identified weaknesses while ensuring compliance with customer standards.\n * Defines the vision and strategy for collaboration efforts between researchers and development teams at the individual product level. Brings new technology and approaches into production by applying long-term research efforts to solve immediate product needs. Drives high-stakes negotiations across teams to ensure cutting edge technology is being applied to products in a practical way that meets key business objectives. Ensures that teams apply an understanding of research approaches used across and outside of the company to leverage (and not re-invent) solutions. Represents the organization across the company.\n * Incorporates key business and product requirements to define a clear agenda and vision that influences the direction of the company/products and provides a competitive or strategic advantage. Drives programs structured around the specificity of key business challenges. Provides strategic direction for the kinds of data used to solve problems.\n * Embody our culture and values.\n   \n   \n\nQualifications\n\nRequired Qualifications\n\n\n * Bachelor's Degree in Computer Science, Machine Learning or Artificial Intelligence, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR Master's Degree in Computer Science, Machine Learning or Artificial Intelligence, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR Doctorate in Computer Science, Machine Learning or Artificial Intelligence, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR equivalent experience.\n\n * Proven experience in training large-scale modern Machine Learning (ML) models (e.g., transformers, diffusion models, foundation models).\n * Hands-on experience in key model optimization techniques (e.g., mixed precision training, distributed training, fine-tuning, RLHF, LoRA).\n * Familiarity with model evaluation, data curation pipelines, and reproducible research practices.\n   \n\nPreferred Qualifications\n\n\n * Master's Degree in Computer Science, Machine Learning or Artificial Intelligence, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) \n    * OR Doctorate in Computer Science, Machine Learning or Artificial Intelligence, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research) \n    * OR equivalent experience. \n\n * Deep understanding of modern deep learning frameworks such as PyTorch or TensorFlow, and scalable training infrastructure.\n * First-author publication in top-tier machine learning conferences or journals (e.g., NeurIPS, ICML, ICLR, CVPR, ACL).\n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "107 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Engineering and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1856522/Senior-Machine-Learning-Engineer?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Search Specialist, Ads Solutions",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-31",
  "jobUrl": "https://in.linkedin.com/jobs/view/search-specialist-ads-solutions-at-google-4274222101?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India; Gurgaon, Haryana, India.Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring campaigns and providing client solutions.\n   \n   \n\nPreferred qualifications:\n\n\n * 3 years of experience with Internet products and technologies.\n * Experience in data analysis, with the ability to interpret datasets, identify trends, and translate findings into compelling narratives.\n * Knowledge of apps platforms and products, the performance advertising market, or online ads landscape.\n * Ability to collaborate cross-functionally with multiple teams and stakeholders while building relationships.\n * Excellent project management skills, with the ability to oversee multiple, simultaneous solutions, supported by internal teams.\n * Excellent business communication, negotiation, and influencing skills.\n   \n   \n\nAbout The Job\n\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\n\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video .\n\nResponsibilities\n\n\n * Advise key Google Ads clients, leveraging digital marketing and tech solutions to address business issues, collaborate as a thought partner, design media plans, and deliver technical solutions to achieve business goals.\n * Build relationships with external advertisers to deliver business outcomes through Google Ads, supporting planning, pitching, implementation, and optimization to boost product adoption and business growth.\n * Collaborate with teams to drive growth plans for clients, develop and apply insights of market and competitive environment for vertical and sub-verticals in solutions offered.\n * Deliver consultative digital marketing solutions that address issues and enhance the customer's experience.\n * Advocate new product features, assist with adoption through setup and provide technical guidance for infrastructure and data integration in Google Ads.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, Advertising, and Customer Service",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/80773057190208198-search-specialist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Senior Applied Scientist",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 day ago",
  "publishedAt": "2025-08-08",
  "jobUrl": "https://in.linkedin.com/jobs/view/senior-applied-scientist-at-microsoft-4282303409?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "As a Senior Applied Scientist, you will play a critical role in advancing Outlook's Co-pilot efforts in the areas of Large Language Model (LLM), Prompt Engineering, Finetuning, Evaluation, Relevance and Responsible AI (RAI). This multifaceted role is responsible for developing an end-to-end infrastructure and measurement framework, fostering cross-functional collaboration, and leveraging data science and AI expertise to guide decision-making. The successful candidate will work with multiple large organizations and stakeholders to drive the evaluation of our LLM systems and associated components.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * Strategic Leadership: Develop and execute a comprehensive strategy for LLM evaluation, encompassing LLM quality, costs, model performance, model utility (user experience and prompt effectiveness), and responsible AI considerations, in alignment with company-wide efforts and informed by emerging research. Drive cost effective solutions such as SLMs, or finetuned models.\n * Data Science Expertise: Utilize strong data science skills to design experimentation, analyze data, create OKRs, create measurement and metrics, and derive actionable insights to enhance LLM systems. Responsible for influencing product and user experience based on evaluation results.\n * Model and Prompt Evaluation: Lead efforts to assess and improve the performance and effectiveness of language models and prompts, driving iterative enhancements, including synthetic and manufactured data creation.\n * Program Management: Oversee and manage large-scale, cross-functional evaluation programs, ensuring alignment with organizational objectives and timelines. Develop and maintain a robust measurement framework to track and report on LLM performance and user impact. Drive engineering product roadmap to construct automated evaluation pipelines integrated into the product workflow.\n * User Experience Enhancement: Collaborate with User Experience teams to evaluate and optimize user interactions with AI systems, enhancing user satisfaction.\n * Responsible AI (RAI): Implement RAI and DSB principles and guidelines in AI systems, ensuring ethical and unbiased practices in model development and deployment.\n * Contribute to the LLM research body: form partnerships and lead deep research initiatives in areas of LLM evaluation and user experience optimization that contribute to the scientific body and deepen the product team's understanding and expertise of user mental models of and alignment to LLM-powered experience.\n * Cross-Functional Collaboration: Work with engineering, research, product, and other teams to ensure seamless integration of evaluation processes into the development lifecycle.\n * Stakeholder Engagement: Communicate findings and recommendations to executive leadership, fostering a data-driven culture within the organization.\n   \n   \n\nQualifications\n\nRequired Qualifications:\n\n\n * Ph.D. or Master’s in a relevant field (e.g., Data Science, Computer Science, Social science, HCI, etc.).\n * Extensive experience in data science, machine learning, experimentation, and AI, with a strong track record of delivering impactful results.\n * Expertise of LLM in finetuning, reinforcement learning, evaluation techniques, implementing RAG techniques, agentic workflows and industry best practices.\n * Proven expertise in program management and leading cross-functional teams.\n * Solid development experience in Python.\n * Excellent analytical and problem-solving skills.\n * Exceptional communication and presentation abilities.\n * Solid understanding of responsible AI principles.\n * Ability to work in a fast-paced and dynamic environment.\n   \n   \n\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n\n\n * Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n   \n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "30 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1857293/Senior-Applied-Scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Principal Applied Scientist",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-25",
  "jobUrl": "https://in.linkedin.com/jobs/view/principal-applied-scientist-at-microsoft-4275651046?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "How would you like to do the AI research and directly affect the lives of billions of humans? Would you like to be responsible for models and code running across tens of thousands of machines across datacenters around the world? What if you could multiply your impact by making developers around the world better? If you like building highly motivated and productive teams, we have got interesting opportunities for you.\n\nOur team focuses on strategic workloads like M365 Copilot App, Outlook, Teams, Copilot Extensibility, and all productivity applications in M365.  The team obsesses about powering workloads with AI and innovates on next generation engineering infrastructure, tooling using AI. This provides every engineer with exceptional opportunities for rich learning, end-to-end ownership, autonomy, innovation and professional growth. \n\n \n\nOur team of Principal Applied Scientists is chartered to tackle a wide variety of challenges, from building data ingestion to curating data to fine tuning prompts and models.  The scientists focus on evaluation metrics to make purpose-built SLMs to infuse AI in productivity scenarios. Every member of this team is expected to collaborate with other teams across Microsoft that are building AI platforms, models and products. She is expected to lead the feature crews with a growth mindset for embracing and extending the rapidly evolving innovations and breakthroughs in this field.  \n\n \n\nMicrosoft is committed to Responsible AI and digital safety for all. Every member of the team is expected to work through these frameworks to preserve our commitment to responsible AI while innovating rapidly. She needs to be self-driven, proactive, results-oriented and ready to work with minimal ongoing direction to succeed in this environment of rapid changes and building products from grounds up. \n\nThe M365 org plays a pivotal role in powering end user experiences (copilots and beyond) powered by highly relevant search capability leveraging M365 eco system.\n\n \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\n * You will master a broad area or research and understand any applicable research techniques. You’ll also serve as a team expert on changes in industry trends, products, and other advances, and apply this knowledge to influence product needs.\n * You will review business and product requirement, incorporate research, and provide strategic direction for problem solving. You’ll also ensure scientific rigor, support the development of methods, and apply your expertise to support business impact.\n * You will identify and inspire peers and new research talent to join Microsoft, build relationships, and advocate for research initiatives. You’ll share research findings through industry outreach, collaborate with the academic community, and help develop the recruiting pipeline.\n * You will document work and experimentation results and share findings to promote innovation. You’ll provide guidance when capturing processes and contribute to ethics and privacy policies related to research processes and data collection.\n   \n   \n\nQualifications\n\nRequired Qualifications:\n\n\n * Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 6+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience (e.g., statistics, predictive analytics, research)\n    * OR equivalent experience.\n\n * 5+ years of working in an AI research facility or working with software services / experiences infused with AI. \n * Strong customer focus and passion for doing the right thing for the customer.\n * Proven ability to establish trusted, effective relationships across diverse sets of stakeholders.\n * Excellent communication skills and cross group collaboration.\n * Ability to keep pace with rapid innovations in the field and to be creative to solve problems with no past techniques.\n * Experience in developing / working with highly scalable classifiers, ranking algorithms, SL.\n   \n\nPreferred Qualifications\n\n\n * PhD with Computer Science with Data Science focus, Mathematics, Statistics, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results)    \n * Master’s degree with Computer Science with Data Science focus, Mathematics, Statistics, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) \n    * OR Bachelor’s degree with Computer Science with Data Science focus, Mathematics, Statistics, or related field AND 8+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results) \n    * OR equivalent experience. \n      \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "27 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1822857/Principal-Applied-Scientist?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Search Specialist, Ads Solutions",
  "location": "Gurgaon, Haryana, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-31",
  "jobUrl": "https://in.linkedin.com/jobs/view/search-specialist-ads-solutions-at-google-4274217686?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India; Gurgaon, Haryana, India.Minimum qualifications:\n\n\n * Bachelor's degree or equivalent practical experience.\n * 2 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring campaigns and providing client solutions.\n   \n   \n\nPreferred qualifications:\n\n\n * 3 years of experience with Internet products and technologies.\n * Experience in data analysis, with the ability to interpret datasets, identify trends, and translate findings into compelling narratives.\n * Knowledge of apps platforms and products, the performance advertising market, or online ads landscape.\n * Ability to collaborate cross-functionally with multiple teams and stakeholders while building relationships.\n * Excellent project management skills, with the ability to oversee multiple, simultaneous solutions, supported by internal teams.\n * Excellent business communication, negotiation, and influencing skills.\n   \n   \n\nAbout The Job\n\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\n\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video .\n\nResponsibilities\n\n\n * Advise key Google Ads clients, leveraging digital marketing and tech solutions to address business issues, collaborate as a thought partner, design media plans, and deliver technical solutions to achieve business goals.\n * Build relationships with external advertisers to deliver business outcomes through Google Ads, supporting planning, pitching, implementation, and optimization to boost product adoption and business growth.\n * Collaborate with teams to drive growth plans for clients, develop and apply insights of market and competitive environment for vertical and sub-verticals in solutions offered.\n * Deliver consultative digital marketing solutions that address issues and enhance the customer's experience.\n * Advocate new product features, assist with adoption through setup and provide technical guidance for infrastructure and data integration in Google Ads.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, Advertising, and Customer Service",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/80773057190208198-search-specialist/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Product Manager II",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "2 days ago",
  "publishedAt": "2025-08-07",
  "jobUrl": "https://in.linkedin.com/jobs/view/product-manager-ii-at-microsoft-4281608276?trk=public_jobs_topcard-title",
  "companyName": "Microsoft",
  "companyUrl": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
  "description": "Microsoft 365 Copilot is redefining the future of work by bringing the power of AI directly into your everyday tools. We are looking for a Product Manager to join us on this mission to build a truly AI-first assistant that fits seamlessly into the workflows of our users. This is a high-impact role where you will shape the experience for millions of users using the M365 Copilot app on their desktop devices, working at the intersection of AI, productivity, and mobile innovation.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nWe’re looking for a customer-focused Product Manager II to join us on this mission.\n\nResponsibilities\n\n\n *   Use data, customer insights and partnership across PM, engineering, data science, user research and design disciplines to develop and deliver product improvements with hypothesis for growth, discovery and satisfaction in the M365 Copilot app (Windows/Mac).\n * Develop deep understanding of the business, our customers, and the competitive landscape through market and customer research.\n * Partner across engineering teams, design, marketing, and business execute on the roadmap — focus on rapid iteration, learning and improvement.\n * Define clear metrics and projected impact for all investments using a product and customer led growth approach.\n * Foster an environment that encourages diversity of thought and an inclusive team culture in a geographically distributed and hybrid work environment.\n   \n   \n\nQualifications\n\nRequired Qualifications:\n\n\n * 3+ years of Product Management experience on end-user facing products.\n * Bachelor's degree in computer science, Engineering, related field or equivalent industry experience.\n * Experience and expertise with data to address business needs, apply analytical and inferential techniques to answer questions and produce product recommendations in partnership across disciplines preferred.\n * Proven ability to develop product roadmaps to deliver customer and business value across products and services.\n * Experience working with data or AI-powered products to deliver greater user value.\n * Track record of successful design, delivery, and iteration on complex projects with a diverse set of stakeholders.\n * Experience with customer-centric and data-driven insights creation, strategy definition, and experimentation\n * Customer empathy with experience in user-centered design; demonstrated success in translating business strategy into product investments.\n   \n   \n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
  "applicationsCount": "155 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Product Management and Marketing",
  "sector": "Software Development",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1035",
  "applyUrl": "https://careers.microsoft.com/us/en/job/1856219/Product-Manager-II?jobsource=linkedin&utm_source=Job%20Board&utm_campaign=linkedin-feed",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Data Scientist II, ML",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "1 day ago",
  "publishedAt": "2025-08-08",
  "jobUrl": "https://in.linkedin.com/jobs/view/data-scientist-ii-ml-at-uber-4281839943?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About the Role\n\nWe are looking for an experienced Data Scientist to join our FinTech - Data Science team and make significant contributions to our mission to streamline and optimize Uber’s financial infrastructure and processes. In this position, you will get an amazing opportunity to leverage advanced analytics including machine learning to play a critical role in implementing solutions for Treasury, a key pillar within Finance. Specifically, the role will focus on enabling Uber's Treasury team with its key objective of liquidity management by building models for cash flow forecasting, performing insights based analyses for optimization of treasury payments, building enhancements for the treasury data store, developing anomaly detection frameworks to ensure data quality etc. Besides liquidity management, Treasury is also responsible for managing foreign exchange exposure, investments, debt management etc., and as data scientist you will get a chance to help out with specific objectives in these areas.\n\nYou will work closely with senior leaders in Product, Data Science, Engineering, Finance, Accounting and Compliance on fast moving, high-stakes problems. A deep analytical passion and the ability to execute on key business priorities is a must for this role. Your performance is measured by the insights you give, effectiveness of communication, and the initiative to drive ideas and implement them into action.\n\n\n\n\n\nWhat the Candidate Will Need / Bonus Point\n\n\n\n\ns\n---- What the Candidate Will Do --\n\n 1. --Work with Treasury Finance, Product, Compliance, Engineering, Operations, Accounting and other business stakeholders in mining and analyzing financial data to extract key trends and insight\n 2. s.Refine ambiguous requirements and design data science solutions that benefit product through a deep understanding of the data, our customers in finance and our busine\n 3. ssBuild ML models to forecast key metrics, automate detection of anomalies in the data, investigate and resolve the discrepancie\n 4. s.Build effective visualizations to communicate data to key cross-functional peers and key decision-makers. Be a trusted advisor to stakeholder\n 5. s.Explore FinTech systems/data to proactively identify and initiate process improvements for cost savings and efficiencie\n 6. s.Get a deep understanding of financial systems and data flows involved; document and train junior data scientists to institutionalize the learnings of the data science practic\n\n\n\n\ne.\n---- Basic Qualifications -\n\n 1. ---Degree in Math, Economics, Bioinformatics, Statistics, Engineering, Computer Science, or other quantitative fields with a minimum of 4+ years of industry experience as a Data Scientist or equival\n 2. entAdvanced SQL expert\n 3. iseExperience with R or Pyt\n 4. honExperience with exploratory data analysis, statistical analysis and testing, and model developm\n 5. entAbility and experience in extracting insights from data, and summarizing learnings / takeaways to cross-functional stakeholde\n 6. rs.Experience with Excel and some dashboarding/data visualization (i.e. Tableau, Mixpanel, Looker, or simil\n\n\n\n\nar)\n---- Preferred Qualifications\n\n 1. ----Experience working on analytics in accounting, finance, fintech, payments or related a\n 2. reasHands-on experience building and deploying ML models; experience with forecasting and anomaly detection is prefer\n 3. red.Proven track record to wrangle large datasets, extract insights from data, and summarize learnings/takeaw\n 4. ays.Strong communication and organization sk\n 5. illsAbility to drive independent execution and multi-task while maintaining quality and de\n 6. tailDemonstrated aptitude toward data storytelling and root cause analysis using\n 7. dataAbility to understand critical interdependencies across functions and divisions, as well as the short and long-term trade-offs of business decisi\n\n\n\n\nons.",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Associate",
  "workType": "Analyst and Information Technology",
  "sector": "Internet Marketplace Platforms and Financial Services",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://www.uber.com/global/en/careers/list/136461/?uclick_id=4b550db8-b84c-417a-836c-bd9a663e085e",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Engineering Manager, HR Engineering",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-08-01",
  "jobUrl": "https://in.linkedin.com/jobs/view/engineering-manager-hr-engineering-at-google-4236803297?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in Computer Science, Engineering, or a related field or equivalent practical experience.\n * 8 years of experience in managing and leading software engineering teams with AI/ML.\n   \n   \n\nPreferred qualifications:\n\n\n * 7 years of experience in software development with AI/ML applications.\n * Experience in the development and deployment of AI/ML systems with HR data.\n   \n   \n\nAbout The Job\n\nLike Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\n\nThe Human Resources Engineering (HRE) team at Google is dedicated to building technology solutions that empower Google's global workforce. We leverage the power of data and AI/ML to optimize Human Resources (HR) processes, enhance employee experiences, and drive organizational efficiency.\n\nIn this role, you will be applying Artificial Intelligence (AI) to solve tests within a fluid domain.\n\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. We deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.\n\nResponsibilities\n\n\n * Provide technical leadership and direction for a significant portion of the AI Software Engineering organization aligning with HRE and Artificial Intelligence/Machine Learning (AI/ML) strategies.\n * Manage and mentor a team of Engineering Managers (EMs) or lead teams of AI Software Engineers, promoting a collaborative environment.\n * Drive the technical strategy for major AI/ML initiatives within HRE, ensuring scalability, reliability, security, and maintainability of our systems.\n * Collaborate with executive product leaders and HR stakeholders to define product roadmaps, influence direction, and translate business objectives into AI/ML solutions.\n * Oversee the design, development, and deployment of AI/ML systems and infrastructure related to HR applications (e.g., talent acquisition, performance management, employee experience, workforce planning, compensation and benefits).\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "99 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Information Technology and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/83683009537942214-engineering-manager/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Software Engineer III, AI/ML, Google Cloud",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "1 week ago",
  "publishedAt": "2025-07-29",
  "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-iii-ai-ml-google-cloud-at-google-4273784458?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor’s degree or equivalent practical experience.\n * 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n * 1 year of experience with one or more of the following: Speech/audio (e.g., technology duplicating and responding to the human voice), reinforcement learning (e.g., sequential decision making), ML infrastructure, or specialization in another ML field.\n * 1 year of experience with ML infrastructure (e.g., model deployment, model evaluation, optimization, data processing, debugging).\n   \n   \n\nPreferred qualifications:\n\n\n * Master's degree or PhD in Computer Science or related technical fields.\n * 2 years of experience with data structures or algorithms.\n * Experience developing accessible technologies.\n   \n   \n\nAbout The Job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n\n * Write product or system development code.\n * Collaborate with peers and stakeholders through design and code reviews to ensure best practices amongst available technologies (e.g., style guidelines, checking code in, accuracy, testability, and efficiency,)\n * Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\n * Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\n * Implement solutions in one or more specialized ML areas, utilize ML infrastructure, and contribute to model optimization and data processing.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "78 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Information Technology and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/130128579382911686-software-engineer-iii/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Machine Learning Engineer, Design Verification, Silicon",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "2 weeks ago",
  "publishedAt": "2025-07-24",
  "jobUrl": "https://in.linkedin.com/jobs/view/machine-learning-engineer-design-verification-silicon-at-google-4259196021?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in Computer Engineering, Electrical Engineering, Computer Science, or related field, or equivalent practical experience.\n * 5 years of experience with ML/AI frameworks and libraries (e.g., TensorFlow, PyTorch, scikit-learn).\n * Experience with hardware description languages (e.g., Verilog, SystemVerilog, VHDL).\n * Experience with applying ML/AI techniques.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience with ML/AI applications in hardware design, verification and Low Power (e.g., formal verification with ML, coverage closure with ML).\n * Experience with verification methodologies (UVM, OVM).\n * Experience in data preprocessing and feature engineering, hardware architecture and microarchitecture.\n * Experience with simulation tools (e.g., Synopsys VCS, Cadence Xcelium, Mentor Questa).\n * Excellent programming skills in Python or C++.\n   \n   \n\nAbout The Job\n\nBe part of a team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.\n\nResponsibilities\n\n\n * Research, design, and implement ML/AI algorithms techniques for various verification tasks, including test case generation, coverage analysis, bug prediction, and performance optimization. Develop and maintain tools and scripts for data collection, pre-processing, model training, and evaluation.\n * Analyze large datasets of simulation results, logs, and other verification data to identify patterns and trends.\n * Build and train ML models for various verification applications, such as anomaly detection, pattern recognition, and prediction.\n * Evaluate model performance and iterate to improve accuracy and efficiency.\n * Participate in verification planning and develop test plans that incorporate ML/AI-driven techniques. Execute verification tests and analyze results to identify bugs and coverage gaps. Develop and maintain verification tools and scripts to automate verification tasks.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "96 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Other, Information Technology, and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/87330440922178246-machine-learning-engineer/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Staff Scientist, Tech",
  "location": "Bengaluru, Karnataka, India",
  "postedTime": "3 weeks ago",
  "publishedAt": "2025-07-20",
  "jobUrl": "https://in.linkedin.com/jobs/view/staff-scientist-tech-at-uber-4240385141?trk=public_jobs_topcard-title",
  "companyName": "Uber",
  "companyUrl": "https://www.linkedin.com/company/uber-com?trk=public_jobs_topcard-org-name",
  "description": "About The Team\n\nEver wondered how Uber makes it seamless to hail an auto or bike taxi in the middle of rush hour, or how pricing works for your next metered cab ride? That's the kind of real-world complexity the Hailables Science team thrives on solving.\n\nAs part of Uber's Core Analytics & Science (CAS) organization, the Hailables team focuses on our fastest-growing Mobility offerings, which include auto rickshaws, bike taxis, and metered cabs. These products operate in high-density, price-sensitive markets with unique customer behaviors and regulatory landscapes. We offer a rare opportunity to work at the frontier of data science in this space.\n\nWe partner closely with product, engineering, and operations teams to design smarter systems. It ranges from more intelligent pricing systems, efficient matching algorithms, and building personalized experience for millions of riders and drivers across emerging markets. From improving pickup reliability to shaping how supply and demand interact in highly dynamic cities, the Hailables team is where science meets street-level scale.\n\nAbout The Role\n\nAs the Science Tech Lead (Individual Contributor) for the Hailables charter, you'll be at the heart of product development, guiding the science direction for a team of 5-7 talented scientists based in India. You'll work closely with Engineering and Product partners to define strategy, shape roadmaps, and drive execution. You will bring data, algorithms, and business context together to solve complex, real-world problems.\n\nIn this role, you won't just influence - you'll build. Whether it's designing machine learning models to improve matching and pricing, uncovering insights through rigorous experimentation, or applying statistical thinking to shape product levers, you'll lead by example. You'll also mentor team members, foster a culture of scientific excellence, and build strong cross-functional relationships with global stakeholders across time zones.\n\nThis is a rare opportunity to lead from the front: as a senior IC, you'll own the scientific vision while staying hands-on, solving meaningful problems that impact millions of users across Uber's fastest-growing mobility products.\n\nBasic Qualifications\n\n\n * Undergraduate and/or graduate degree in Statistics, Machine Learning, Operations Research, or other quantitative fields.\n * 9+ years of industry experience as an (Applied / Data) Scientist or equivalent.\n * Experience with exploratory data analysis, statistical analysis and testing, causal analysis and ML model development.\n * Experience in experimental design and analysis.\n * Proficiency using Python, Spark at scale with large data sets.\n * Experience with tools like SQL, R in a production environment.\n   \n   \n\nPreferred Qualifications\n\n\n * Master's/Ph.D. Degree in Statistics, Machine Learning, Operations Research, or other quantitative fields.\n * Experience in tech or marketplace industries.\n * Experienced in partnering with cross-functional stakeholders to execute decisions.\n * Ability to mentor, coach and develop junior team members.\n * Superb communication and organisation skills.\n   \n   \n\nWhat the candidate will do\n\n\n * Define the science roadmap in collaboration with Product and Engineering, identifying key opportunities to improve rider and driver experience across autos, bike taxis, and metered cabs.\n * Design and prototype machine learning and statistical solutions to solve core marketplace challenges like pricing, matching, and user funnel optimization.\n * Lead experimentation efforts (A/B, switchback, quasi-experiments), ensuring methodological rigor and high-quality insights.\n * Define and monitor key tech OKRs, ensuring the right metrics are in place and tracked accurately to guide product and engineering execution.\n * Improve data quality, observability, and reliability by partnering with Engineering on logging, metrics, and pipelines.\n * Conduct deep-dive analyses to generate actionable insights and influence product direction.\n * Mentor scientists and promote a culture of excellence in modeling, experimentation, and analytics.\n * Communicate scientific work and outcomes clearly to cross-functional stakeholders and leadership.",
  "applicationsCount": "77 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Internet Marketplace Platforms",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1815218",
  "applyUrl": "https://tnl2.jometer.com/v2/job?jz=5wqzsf8543241aa57e8ddb005f571a1807101M4ALBBQAAADQ&iis=Job%20Board%20-%20Recruitment%20Marketing&iisn=LinkedIn",
  "applyType": "EXTERNAL",
  "benefits": ""
},
{
  "title": "Engineering Director, AI, HR Engineering",
  "location": "Hyderabad, Telangana, India",
  "postedTime": "5 days ago",
  "publishedAt": "2025-08-05",
  "jobUrl": "https://in.linkedin.com/jobs/view/engineering-director-ai-hr-engineering-at-google-4266573496?trk=public_jobs_topcard-title",
  "companyName": "Google",
  "companyUrl": "https://www.linkedin.com/company/google?trk=public_jobs_topcard-org-name",
  "description": "Minimum qualifications:\n\n\n * Bachelor's degree in Electrical Engineering, Computer Science, relevant technical field (with an emphasis on machine learning/artificial intelligence), or equivalent practical experience.\n * 15 years of experience in software engineering, with 3 years of experience in a leadership role managing engineering teams (40+ engineers).\n * Experience in leading the development and deployment of machine learning and AI-powered products in a production environment.\n   \n   \n\nPreferred qualifications:\n\n\n * Experience in the HR domain or HR tech.\n * Experience in strategic thinking with strong communication and problem-solving abilities.\n * Deep understanding of various AI/ML techniques, including Natural Language Processing (NLP), computer vision, predictive analytics, recommendation systems, etc.\n * Familiarity with ML frameworks (e.g., TensorFlow, PyTorch, Scikit-learn).\n * Strong background in MLOps, data engineering, and cloud platforms (GCP).\n   \n   \n\nAbout The Job\n\nThe HR Engineering team builds people and culture solutions and powers the HR technology that underpins the entirety of a Googler’s career, from hire to retire.\n\nWe are seeking a highly accomplished and visionary Engineering Director to lead the technical strategy, prototype to development, and execution for our new \"AI Accelerator for HR Function\" team in Hyderabad. This is a foundational leadership role, pivotal in building and scaling a team of AI/ML engineers and Product Managers collaborating closely with UX to deliver innovative artificial intelligence solutions that revolutionize our HR operations.\n\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. We deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.\n\nResponsibilities\n\n\n * Define the AI Accelerator's technical vision and roadmap. Stay current with AI, HR Tech, and cloud technologies to ensure scalable, secure, and high-performance architectural solutions.\n * Recruit and lead a team of AI/ML engineers and scientists. Mentor talent, foster a culture of innovation, optimize processes, and support team career growth.\n * Oversee the complete development lifecycle of AI products. Ensure timely delivery of high-quality solutions that meet business needs while identifying and mitigating technical risks.\n * Work with product managers to create technical specifications from business requirements. Partner with stakeholders and other teams to ensure seamless integration and adherence to enterprise standards.\n * Implement monitoring for production AI models. Manage budgets, resource allocation, and project planning to drive operational efficiency.\n   \n   \n   \n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
  "applicationsCount": "Over 200 applicants",
  "contractType": "Full-time",
  "experienceLevel": "Director",
  "workType": "Information Technology and Engineering",
  "sector": "Information Services and Technology, Information and Internet",
  "salary": "",
  "posterFullName": "",
  "posterProfileUrl": "",
  "companyId": "1441",
  "applyUrl": "https://careers.google.com/jobs/results/87008173956702918-engineering-director/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract",
  "applyType": "EXTERNAL",
  "benefits": ""
}]